Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/tram.h
#define TRAM_RAM746_REG_OFST           _UINT32_(0x1BA8)    /* (TRAM_RAM746) TrustRAM Offset */
#define TRAM_RAM747_REG_OFST           _UINT32_(0x1BAC)    /* (TRAM_RAM747) TrustRAM Offset */
#define TRAM_RAM748_REG_OFST           _UINT32_(0x1BB0)    /* (TRAM_RAM748) TrustRAM Offset */
#define TRAM_RAM749_REG_OFST           _UINT32_(0x1BB4)    /* (TRAM_RAM749) TrustRAM Offset */
#define TRAM_RAM750_REG_OFST           _UINT32_(0x1BB8)    /* (TRAM_RAM750) TrustRAM Offset */
#define TRAM_RAM751_REG_OFST           _UINT32_(0x1BBC)    /* (TRAM_RAM751) TrustRAM Offset */
#define TRAM_RAM752_REG_OFST           _UINT32_(0x1BC0)    /* (TRAM_RAM752) TrustRAM Offset */
#define TRAM_RAM753_REG_OFST           _UINT32_(0x1BC4)    /* (TRAM_RAM753) TrustRAM Offset */
#define TRAM_RAM754_REG_OFST           _UINT32_(0x1BC8)    /* (TRAM_RAM754) TrustRAM Offset */
#define TRAM_RAM755_REG_OFST           _UINT32_(0x1BCC)    /* (TRAM_RAM755) TrustRAM Offset */
#define TRAM_RAM756_REG_OFST           _UINT32_(0x1BD0)    /* (TRAM_RAM756) TrustRAM Offset */
#define TRAM_RAM757_REG_OFST           _UINT32_(0x1BD4)    /* (TRAM_RAM757) TrustRAM Offset */
#define TRAM_RAM758_REG_OFST           _UINT32_(0x1BD8)    /* (TRAM_RAM758) TrustRAM Offset */
#define TRAM_RAM759_REG_OFST           _UINT32_(0x1BDC)    /* (TRAM_RAM759) TrustRAM Offset */
#define TRAM_RAM760_REG_OFST           _UINT32_(0x1BE0)    /* (TRAM_RAM760) TrustRAM Offset */
#define TRAM_RAM761_REG_OFST           _UINT32_(0x1BE4)    /* (TRAM_RAM761) TrustRAM Offset */
#define TRAM_RAM762_REG_OFST           _UINT32_(0x1BE8)    /* (TRAM_RAM762) TrustRAM Offset */
#define TRAM_RAM763_REG_OFST           _UINT32_(0x1BEC)    /* (TRAM_RAM763) TrustRAM Offset */
#define TRAM_RAM764_REG_OFST           _UINT32_(0x1BF0)    /* (TRAM_RAM764) TrustRAM Offset */
#define TRAM_RAM765_REG_OFST           _UINT32_(0x1BF4)    /* (TRAM_RAM765) TrustRAM Offset */
#define TRAM_RAM766_REG_OFST           _UINT32_(0x1BF8)    /* (TRAM_RAM766) TrustRAM Offset */
#define TRAM_RAM767_REG_OFST           _UINT32_(0x1BFC)    /* (TRAM_RAM767) TrustRAM Offset */
#define TRAM_RAM768_REG_OFST           _UINT32_(0x1C00)    /* (TRAM_RAM768) TrustRAM Offset */
#define TRAM_RAM769_REG_OFST           _UINT32_(0x1C04)    /* (TRAM_RAM769) TrustRAM Offset */
#define TRAM_RAM770_REG_OFST           _UINT32_(0x1C08)    /* (TRAM_RAM770) TrustRAM Offset */
#define TRAM_RAM771_REG_OFST           _UINT32_(0x1C0C)    /* (TRAM_RAM771) TrustRAM Offset */
#define TRAM_RAM772_REG_OFST           _UINT32_(0x1C10)    /* (TRAM_RAM772) TrustRAM Offset */
#define TRAM_RAM773_REG_OFST           _UINT32_(0x1C14)    /* (TRAM_RAM773) TrustRAM Offset */
#define TRAM_RAM774_REG_OFST           _UINT32_(0x1C18)    /* (TRAM_RAM774) TrustRAM Offset */
#define TRAM_RAM775_REG_OFST           _UINT32_(0x1C1C)    /* (TRAM_RAM775) TrustRAM Offset */
#define TRAM_RAM776_REG_OFST           _UINT32_(0x1C20)    /* (TRAM_RAM776) TrustRAM Offset */
#define TRAM_RAM777_REG_OFST           _UINT32_(0x1C24)    /* (TRAM_RAM777) TrustRAM Offset */
#define TRAM_RAM778_REG_OFST           _UINT32_(0x1C28)    /* (TRAM_RAM778) TrustRAM Offset */
#define TRAM_RAM779_REG_OFST           _UINT32_(0x1C2C)    /* (TRAM_RAM779) TrustRAM Offset */
#define TRAM_RAM780_REG_OFST           _UINT32_(0x1C30)    /* (TRAM_RAM780) TrustRAM Offset */
#define TRAM_RAM781_REG_OFST           _UINT32_(0x1C34)    /* (TRAM_RAM781) TrustRAM Offset */
#define TRAM_RAM782_REG_OFST           _UINT32_(0x1C38)    /* (TRAM_RAM782) TrustRAM Offset */
#define TRAM_RAM783_REG_OFST           _UINT32_(0x1C3C)    /* (TRAM_RAM783) TrustRAM Offset */
#define TRAM_RAM784_REG_OFST           _UINT32_(0x1C40)    /* (TRAM_RAM784) TrustRAM Offset */
#define TRAM_RAM785_REG_OFST           _UINT32_(0x1C44)    /* (TRAM_RAM785) TrustRAM Offset */
#define TRAM_RAM786_REG_OFST           _UINT32_(0x1C48)    /* (TRAM_RAM786) TrustRAM Offset */
#define TRAM_RAM787_REG_OFST           _UINT32_(0x1C4C)    /* (TRAM_RAM787) TrustRAM Offset */
#define TRAM_RAM788_REG_OFST           _UINT32_(0x1C50)    /* (TRAM_RAM788) TrustRAM Offset */
#define TRAM_RAM789_REG_OFST           _UINT32_(0x1C54)    /* (TRAM_RAM789) TrustRAM Offset */
#define TRAM_RAM790_REG_OFST           _UINT32_(0x1C58)    /* (TRAM_RAM790) TrustRAM Offset */
#define TRAM_RAM791_REG_OFST           _UINT32_(0x1C5C)    /* (TRAM_RAM791) TrustRAM Offset */
#define TRAM_RAM792_REG_OFST           _UINT32_(0x1C60)    /* (TRAM_RAM792) TrustRAM Offset */
#define TRAM_RAM793_REG_OFST           _UINT32_(0x1C64)    /* (TRAM_RAM793) TrustRAM Offset */
#define TRAM_RAM794_REG_OFST           _UINT32_(0x1C68)    /* (TRAM_RAM794) TrustRAM Offset */
#define TRAM_RAM795_REG_OFST           _UINT32_(0x1C6C)    /* (TRAM_RAM795) TrustRAM Offset */
#define TRAM_RAM796_REG_OFST           _UINT32_(0x1C70)    /* (TRAM_RAM796) TrustRAM Offset */
#define TRAM_RAM797_REG_OFST           _UINT32_(0x1C74)    /* (TRAM_RAM797) TrustRAM Offset */
#define TRAM_RAM798_REG_OFST           _UINT32_(0x1C78)    /* (TRAM_RAM798) TrustRAM Offset */
#define TRAM_RAM799_REG_OFST           _UINT32_(0x1C7C)    /* (TRAM_RAM799) TrustRAM Offset */
#define TRAM_RAM800_REG_OFST           _UINT32_(0x1C80)    /* (TRAM_RAM800) TrustRAM Offset */
#define TRAM_RAM801_REG_OFST           _UINT32_(0x1C84)    /* (TRAM_RAM801) TrustRAM Offset */
#define TRAM_RAM802_REG_OFST           _UINT32_(0x1C88)    /* (TRAM_RAM802) TrustRAM Offset */
#define TRAM_RAM803_REG_OFST           _UINT32_(0x1C8C)    /* (TRAM_RAM803) TrustRAM Offset */
#define TRAM_RAM804_REG_OFST           _UINT32_(0x1C90)    /* (TRAM_RAM804) TrustRAM Offset */
#define TRAM_RAM805_REG_OFST           _UINT32_(0x1C94)    /* (TRAM_RAM805) TrustRAM Offset */
#define TRAM_RAM806_REG_OFST           _UINT32_(0x1C98)    /* (TRAM_RAM806) TrustRAM Offset */
#define TRAM_RAM807_REG_OFST           _UINT32_(0x1C9C)    /* (TRAM_RAM807) TrustRAM Offset */
#define TRAM_RAM808_REG_OFST           _UINT32_(0x1CA0)    /* (TRAM_RAM808) TrustRAM Offset */
#define TRAM_RAM809_REG_OFST           _UINT32_(0x1CA4)    /* (TRAM_RAM809) TrustRAM Offset */
#define TRAM_RAM810_REG_OFST           _UINT32_(0x1CA8)    /* (TRAM_RAM810) TrustRAM Offset */
#define TRAM_RAM811_REG_OFST           _UINT32_(0x1CAC)    /* (TRAM_RAM811) TrustRAM Offset */
#define TRAM_RAM812_REG_OFST           _UINT32_(0x1CB0)    /* (TRAM_RAM812) TrustRAM Offset */
#define TRAM_RAM813_REG_OFST           _UINT32_(0x1CB4)    /* (TRAM_RAM813) TrustRAM Offset */
#define TRAM_RAM814_REG_OFST           _UINT32_(0x1CB8)    /* (TRAM_RAM814) TrustRAM Offset */
#define TRAM_RAM815_REG_OFST           _UINT32_(0x1CBC)    /* (TRAM_RAM815) TrustRAM Offset */
#define TRAM_RAM816_REG_OFST           _UINT32_(0x1CC0)    /* (TRAM_RAM816) TrustRAM Offset */
#define TRAM_RAM817_REG_OFST           _UINT32_(0x1CC4)    /* (TRAM_RAM817) TrustRAM Offset */
#define TRAM_RAM818_REG_OFST           _UINT32_(0x1CC8)    /* (TRAM_RAM818) TrustRAM Offset */
#define TRAM_RAM819_REG_OFST           _UINT32_(0x1CCC)    /* (TRAM_RAM819) TrustRAM Offset */
#define TRAM_RAM820_REG_OFST           _UINT32_(0x1CD0)    /* (TRAM_RAM820) TrustRAM Offset */
#define TRAM_RAM821_REG_OFST           _UINT32_(0x1CD4)    /* (TRAM_RAM821) TrustRAM Offset */
#define TRAM_RAM822_REG_OFST           _UINT32_(0x1CD8)    /* (TRAM_RAM822) TrustRAM Offset */
#define TRAM_RAM823_REG_OFST           _UINT32_(0x1CDC)    /* (TRAM_RAM823) TrustRAM Offset */
#define TRAM_RAM824_REG_OFST           _UINT32_(0x1CE0)    /* (TRAM_RAM824) TrustRAM Offset */
#define TRAM_RAM825_REG_OFST           _UINT32_(0x1CE4)    /* (TRAM_RAM825) TrustRAM Offset */
#define TRAM_RAM826_REG_OFST           _UINT32_(0x1CE8)    /* (TRAM_RAM826) TrustRAM Offset */
#define TRAM_RAM827_REG_OFST           _UINT32_(0x1CEC)    /* (TRAM_RAM827) TrustRAM Offset */
#define TRAM_RAM828_REG_OFST           _UINT32_(0x1CF0)    /* (TRAM_RAM828) TrustRAM Offset */
#define TRAM_RAM829_REG_OFST           _UINT32_(0x1CF4)    /* (TRAM_RAM829) TrustRAM Offset */
#define TRAM_RAM830_REG_OFST           _UINT32_(0x1CF8)    /* (TRAM_RAM830) TrustRAM Offset */
#define TRAM_RAM831_REG_OFST           _UINT32_(0x1CFC)    /* (TRAM_RAM831) TrustRAM Offset */
#define TRAM_RAM832_REG_OFST           _UINT32_(0x1D00)    /* (TRAM_RAM832) TrustRAM Offset */
#define TRAM_RAM833_REG_OFST           _UINT32_(0x1D04)    /* (TRAM_RAM833) TrustRAM Offset */
#define TRAM_RAM834_REG_OFST           _UINT32_(0x1D08)    /* (TRAM_RAM834) TrustRAM Offset */
#define TRAM_RAM835_REG_OFST           _UINT32_(0x1D0C)    /* (TRAM_RAM835) TrustRAM Offset */
#define TRAM_RAM836_REG_OFST           _UINT32_(0x1D10)    /* (TRAM_RAM836) TrustRAM Offset */
#define TRAM_RAM837_REG_OFST           _UINT32_(0x1D14)    /* (TRAM_RAM837) TrustRAM Offset */
#define TRAM_RAM838_REG_OFST           _UINT32_(0x1D18)    /* (TRAM_RAM838) TrustRAM Offset */
#define TRAM_RAM839_REG_OFST           _UINT32_(0x1D1C)    /* (TRAM_RAM839) TrustRAM Offset */
#define TRAM_RAM840_REG_OFST           _UINT32_(0x1D20)    /* (TRAM_RAM840) TrustRAM Offset */
#define TRAM_RAM841_REG_OFST           _UINT32_(0x1D24)    /* (TRAM_RAM841) TrustRAM Offset */
#define TRAM_RAM842_REG_OFST           _UINT32_(0x1D28)    /* (TRAM_RAM842) TrustRAM Offset */
#define TRAM_RAM843_REG_OFST           _UINT32_(0x1D2C)    /* (TRAM_RAM843) TrustRAM Offset */
#define TRAM_RAM844_REG_OFST           _UINT32_(0x1D30)    /* (TRAM_RAM844) TrustRAM Offset */
#define TRAM_RAM845_REG_OFST           _UINT32_(0x1D34)    /* (TRAM_RAM845) TrustRAM Offset */
#define TRAM_RAM846_REG_OFST           _UINT32_(0x1D38)    /* (TRAM_RAM846) TrustRAM Offset */
#define TRAM_RAM847_REG_OFST           _UINT32_(0x1D3C)    /* (TRAM_RAM847) TrustRAM Offset */
#define TRAM_RAM848_REG_OFST           _UINT32_(0x1D40)    /* (TRAM_RAM848) TrustRAM Offset */
#define TRAM_RAM849_REG_OFST           _UINT32_(0x1D44)    /* (TRAM_RAM849) TrustRAM Offset */
#define TRAM_RAM850_REG_OFST           _UINT32_(0x1D48)    /* (TRAM_RAM850) TrustRAM Offset */
#define TRAM_RAM851_REG_OFST           _UINT32_(0x1D4C)    /* (TRAM_RAM851) TrustRAM Offset */
#define TRAM_RAM852_REG_OFST           _UINT32_(0x1D50)    /* (TRAM_RAM852) TrustRAM Offset */
#define TRAM_RAM853_REG_OFST           _UINT32_(0x1D54)    /* (TRAM_RAM853) TrustRAM Offset */
#define TRAM_RAM854_REG_OFST           _UINT32_(0x1D58)    /* (TRAM_RAM854) TrustRAM Offset */
#define TRAM_RAM855_REG_OFST           _UINT32_(0x1D5C)    /* (TRAM_RAM855) TrustRAM Offset */
#define TRAM_RAM856_REG_OFST           _UINT32_(0x1D60)    /* (TRAM_RAM856) TrustRAM Offset */
#define TRAM_RAM857_REG_OFST           _UINT32_(0x1D64)    /* (TRAM_RAM857) TrustRAM Offset */
#define TRAM_RAM858_REG_OFST           _UINT32_(0x1D68)    /* (TRAM_RAM858) TrustRAM Offset */
#define TRAM_RAM859_REG_OFST           _UINT32_(0x1D6C)    /* (TRAM_RAM859) TrustRAM Offset */
#define TRAM_RAM860_REG_OFST           _UINT32_(0x1D70)    /* (TRAM_RAM860) TrustRAM Offset */
#define TRAM_RAM861_REG_OFST           _UINT32_(0x1D74)    /* (TRAM_RAM861) TrustRAM Offset */
#define TRAM_RAM862_REG_OFST           _UINT32_(0x1D78)    /* (TRAM_RAM862) TrustRAM Offset */
#define TRAM_RAM863_REG_OFST           _UINT32_(0x1D7C)    /* (TRAM_RAM863) TrustRAM Offset */
#define TRAM_RAM864_REG_OFST           _UINT32_(0x1D80)    /* (TRAM_RAM864) TrustRAM Offset */
#define TRAM_RAM865_REG_OFST           _UINT32_(0x1D84)    /* (TRAM_RAM865) TrustRAM Offset */
#define TRAM_RAM866_REG_OFST           _UINT32_(0x1D88)    /* (TRAM_RAM866) TrustRAM Offset */
#define TRAM_RAM867_REG_OFST           _UINT32_(0x1D8C)    /* (TRAM_RAM867) TrustRAM Offset */
#define TRAM_RAM868_REG_OFST           _UINT32_(0x1D90)    /* (TRAM_RAM868) TrustRAM Offset */
#define TRAM_RAM869_REG_OFST           _UINT32_(0x1D94)    /* (TRAM_RAM869) TrustRAM Offset */
#define TRAM_RAM870_REG_OFST           _UINT32_(0x1D98)    /* (TRAM_RAM870) TrustRAM Offset */
#define TRAM_RAM871_REG_OFST           _UINT32_(0x1D9C)    /* (TRAM_RAM871) TrustRAM Offset */
#define TRAM_RAM872_REG_OFST           _UINT32_(0x1DA0)    /* (TRAM_RAM872) TrustRAM Offset */
#define TRAM_RAM873_REG_OFST           _UINT32_(0x1DA4)    /* (TRAM_RAM873) TrustRAM Offset */
#define TRAM_RAM874_REG_OFST           _UINT32_(0x1DA8)    /* (TRAM_RAM874) TrustRAM Offset */
#define TRAM_RAM875_REG_OFST           _UINT32_(0x1DAC)    /* (TRAM_RAM875) TrustRAM Offset */
#define TRAM_RAM876_REG_OFST           _UINT32_(0x1DB0)    /* (TRAM_RAM876) TrustRAM Offset */
#define TRAM_RAM877_REG_OFST           _UINT32_(0x1DB4)    /* (TRAM_RAM877) TrustRAM Offset */
#define TRAM_RAM878_REG_OFST           _UINT32_(0x1DB8)    /* (TRAM_RAM878) TrustRAM Offset */
#define TRAM_RAM879_REG_OFST           _UINT32_(0x1DBC)    /* (TRAM_RAM879) TrustRAM Offset */
#define TRAM_RAM880_REG_OFST           _UINT32_(0x1DC0)    /* (TRAM_RAM880) TrustRAM Offset */
#define TRAM_RAM881_REG_OFST           _UINT32_(0x1DC4)    /* (TRAM_RAM881) TrustRAM Offset */
#define TRAM_RAM882_REG_OFST           _UINT32_(0x1DC8)    /* (TRAM_RAM882) TrustRAM Offset */
#define TRAM_RAM883_REG_OFST           _UINT32_(0x1DCC)    /* (TRAM_RAM883) TrustRAM Offset */
#define TRAM_RAM884_REG_OFST           _UINT32_(0x1DD0)    /* (TRAM_RAM884) TrustRAM Offset */
#define TRAM_RAM885_REG_OFST           _UINT32_(0x1DD4)    /* (TRAM_RAM885) TrustRAM Offset */
#define TRAM_RAM886_REG_OFST           _UINT32_(0x1DD8)    /* (TRAM_RAM886) TrustRAM Offset */
#define TRAM_RAM887_REG_OFST           _UINT32_(0x1DDC)    /* (TRAM_RAM887) TrustRAM Offset */
#define TRAM_RAM888_REG_OFST           _UINT32_(0x1DE0)    /* (TRAM_RAM888) TrustRAM Offset */
#define TRAM_RAM889_REG_OFST           _UINT32_(0x1DE4)    /* (TRAM_RAM889) TrustRAM Offset */
#define TRAM_RAM890_REG_OFST           _UINT32_(0x1DE8)    /* (TRAM_RAM890) TrustRAM Offset */
#define TRAM_RAM891_REG_OFST           _UINT32_(0x1DEC)    /* (TRAM_RAM891) TrustRAM Offset */
#define TRAM_RAM892_REG_OFST           _UINT32_(0x1DF0)    /* (TRAM_RAM892) TrustRAM Offset */
#define TRAM_RAM893_REG_OFST           _UINT32_(0x1DF4)    /* (TRAM_RAM893) TrustRAM Offset */
#define TRAM_RAM894_REG_OFST           _UINT32_(0x1DF8)    /* (TRAM_RAM894) TrustRAM Offset */
#define TRAM_RAM895_REG_OFST           _UINT32_(0x1DFC)    /* (TRAM_RAM895) TrustRAM Offset */
#define TRAM_RAM896_REG_OFST           _UINT32_(0x1E00)    /* (TRAM_RAM896) TrustRAM Offset */
#define TRAM_RAM897_REG_OFST           _UINT32_(0x1E04)    /* (TRAM_RAM897) TrustRAM Offset */
#define TRAM_RAM898_REG_OFST           _UINT32_(0x1E08)    /* (TRAM_RAM898) TrustRAM Offset */
#define TRAM_RAM899_REG_OFST           _UINT32_(0x1E0C)    /* (TRAM_RAM899) TrustRAM Offset */
#define TRAM_RAM900_REG_OFST           _UINT32_(0x1E10)    /* (TRAM_RAM900) TrustRAM Offset */
#define TRAM_RAM901_REG_OFST           _UINT32_(0x1E14)    /* (TRAM_RAM901) TrustRAM Offset */
#define TRAM_RAM902_REG_OFST           _UINT32_(0x1E18)    /* (TRAM_RAM902) TrustRAM Offset */
#define TRAM_RAM903_REG_OFST           _UINT32_(0x1E1C)    /* (TRAM_RAM903) TrustRAM Offset */
#define TRAM_RAM904_REG_OFST           _UINT32_(0x1E20)    /* (TRAM_RAM904) TrustRAM Offset */
#define TRAM_RAM905_REG_OFST           _UINT32_(0x1E24)    /* (TRAM_RAM905) TrustRAM Offset */
#define TRAM_RAM906_REG_OFST           _UINT32_(0x1E28)    /* (TRAM_RAM906) TrustRAM Offset */
#define TRAM_RAM907_REG_OFST           _UINT32_(0x1E2C)    /* (TRAM_RAM907) TrustRAM Offset */
#define TRAM_RAM908_REG_OFST           _UINT32_(0x1E30)    /* (TRAM_RAM908) TrustRAM Offset */
#define TRAM_RAM909_REG_OFST           _UINT32_(0x1E34)    /* (TRAM_RAM909) TrustRAM Offset */
#define TRAM_RAM910_REG_OFST           _UINT32_(0x1E38)    /* (TRAM_RAM910) TrustRAM Offset */
#define TRAM_RAM911_REG_OFST           _UINT32_(0x1E3C)    /* (TRAM_RAM911) TrustRAM Offset */
#define TRAM_RAM912_REG_OFST           _UINT32_(0x1E40)    /* (TRAM_RAM912) TrustRAM Offset */
#define TRAM_RAM913_REG_OFST           _UINT32_(0x1E44)    /* (TRAM_RAM913) TrustRAM Offset */
#define TRAM_RAM914_REG_OFST           _UINT32_(0x1E48)    /* (TRAM_RAM914) TrustRAM Offset */
#define TRAM_RAM915_REG_OFST           _UINT32_(0x1E4C)    /* (TRAM_RAM915) TrustRAM Offset */
#define TRAM_RAM916_REG_OFST           _UINT32_(0x1E50)    /* (TRAM_RAM916) TrustRAM Offset */
#define TRAM_RAM917_REG_OFST           _UINT32_(0x1E54)    /* (TRAM_RAM917) TrustRAM Offset */
#define TRAM_RAM918_REG_OFST           _UINT32_(0x1E58)    /* (TRAM_RAM918) TrustRAM Offset */
#define TRAM_RAM919_REG_OFST           _UINT32_(0x1E5C)    /* (TRAM_RAM919) TrustRAM Offset */
#define TRAM_RAM920_REG_OFST           _UINT32_(0x1E60)    /* (TRAM_RAM920) TrustRAM Offset */
#define TRAM_RAM921_REG_OFST           _UINT32_(0x1E64)    /* (TRAM_RAM921) TrustRAM Offset */
#define TRAM_RAM922_REG_OFST           _UINT32_(0x1E68)    /* (TRAM_RAM922) TrustRAM Offset */
#define TRAM_RAM923_REG_OFST           _UINT32_(0x1E6C)    /* (TRAM_RAM923) TrustRAM Offset */
#define TRAM_RAM924_REG_OFST           _UINT32_(0x1E70)    /* (TRAM_RAM924) TrustRAM Offset */
#define TRAM_RAM925_REG_OFST           _UINT32_(0x1E74)    /* (TRAM_RAM925) TrustRAM Offset */
#define TRAM_RAM926_REG_OFST           _UINT32_(0x1E78)    /* (TRAM_RAM926) TrustRAM Offset */
#define TRAM_RAM927_REG_OFST           _UINT32_(0x1E7C)    /* (TRAM_RAM927) TrustRAM Offset */
#define TRAM_RAM928_REG_OFST           _UINT32_(0x1E80)    /* (TRAM_RAM928) TrustRAM Offset */
#define TRAM_RAM929_REG_OFST           _UINT32_(0x1E84)    /* (TRAM_RAM929) TrustRAM Offset */
#define TRAM_RAM930_REG_OFST           _UINT32_(0x1E88)    /* (TRAM_RAM930) TrustRAM Offset */
#define TRAM_RAM931_REG_OFST           _UINT32_(0x1E8C)    /* (TRAM_RAM931) TrustRAM Offset */
#define TRAM_RAM932_REG_OFST           _UINT32_(0x1E90)    /* (TRAM_RAM932) TrustRAM Offset */
#define TRAM_RAM933_REG_OFST           _UINT32_(0x1E94)    /* (TRAM_RAM933) TrustRAM Offset */
#define TRAM_RAM934_REG_OFST           _UINT32_(0x1E98)    /* (TRAM_RAM934) TrustRAM Offset */
#define TRAM_RAM935_REG_OFST           _UINT32_(0x1E9C)    /* (TRAM_RAM935) TrustRAM Offset */
#define TRAM_RAM936_REG_OFST           _UINT32_(0x1EA0)    /* (TRAM_RAM936) TrustRAM Offset */
#define TRAM_RAM937_REG_OFST           _UINT32_(0x1EA4)    /* (TRAM_RAM937) TrustRAM Offset */
#define TRAM_RAM938_REG_OFST           _UINT32_(0x1EA8)    /* (TRAM_RAM938) TrustRAM Offset */
#define TRAM_RAM939_REG_OFST           _UINT32_(0x1EAC)    /* (TRAM_RAM939) TrustRAM Offset */
#define TRAM_RAM940_REG_OFST           _UINT32_(0x1EB0)    /* (TRAM_RAM940) TrustRAM Offset */
#define TRAM_RAM941_REG_OFST           _UINT32_(0x1EB4)    /* (TRAM_RAM941) TrustRAM Offset */
#define TRAM_RAM942_REG_OFST           _UINT32_(0x1EB8)    /* (TRAM_RAM942) TrustRAM Offset */
#define TRAM_RAM943_REG_OFST           _UINT32_(0x1EBC)    /* (TRAM_RAM943) TrustRAM Offset */
#define TRAM_RAM944_REG_OFST           _UINT32_(0x1EC0)    /* (TRAM_RAM944) TrustRAM Offset */
#define TRAM_RAM945_REG_OFST           _UINT32_(0x1EC4)    /* (TRAM_RAM945) TrustRAM Offset */
#define TRAM_RAM946_REG_OFST           _UINT32_(0x1EC8)    /* (TRAM_RAM946) TrustRAM Offset */
#define TRAM_RAM947_REG_OFST           _UINT32_(0x1ECC)    /* (TRAM_RAM947) TrustRAM Offset */
#define TRAM_RAM948_REG_OFST           _UINT32_(0x1ED0)    /* (TRAM_RAM948) TrustRAM Offset */
#define TRAM_RAM949_REG_OFST           _UINT32_(0x1ED4)    /* (TRAM_RAM949) TrustRAM Offset */
#define TRAM_RAM950_REG_OFST           _UINT32_(0x1ED8)    /* (TRAM_RAM950) TrustRAM Offset */
#define TRAM_RAM951_REG_OFST           _UINT32_(0x1EDC)    /* (TRAM_RAM951) TrustRAM Offset */
#define TRAM_RAM952_REG_OFST           _UINT32_(0x1EE0)    /* (TRAM_RAM952) TrustRAM Offset */
#define TRAM_RAM953_REG_OFST           _UINT32_(0x1EE4)    /* (TRAM_RAM953) TrustRAM Offset */
#define TRAM_RAM954_REG_OFST           _UINT32_(0x1EE8)    /* (TRAM_RAM954) TrustRAM Offset */
#define TRAM_RAM955_REG_OFST           _UINT32_(0x1EEC)    /* (TRAM_RAM955) TrustRAM Offset */
#define TRAM_RAM956_REG_OFST           _UINT32_(0x1EF0)    /* (TRAM_RAM956) TrustRAM Offset */
#define TRAM_RAM957_REG_OFST           _UINT32_(0x1EF4)    /* (TRAM_RAM957) TrustRAM Offset */
#define TRAM_RAM958_REG_OFST           _UINT32_(0x1EF8)    /* (TRAM_RAM958) TrustRAM Offset */
#define TRAM_RAM959_REG_OFST           _UINT32_(0x1EFC)    /* (TRAM_RAM959) TrustRAM Offset */
#define TRAM_RAM960_REG_OFST           _UINT32_(0x1F00)    /* (TRAM_RAM960) TrustRAM Offset */
#define TRAM_RAM961_REG_OFST           _UINT32_(0x1F04)    /* (TRAM_RAM961) TrustRAM Offset */
#define TRAM_RAM962_REG_OFST           _UINT32_(0x1F08)    /* (TRAM_RAM962) TrustRAM Offset */
#define TRAM_RAM963_REG_OFST           _UINT32_(0x1F0C)    /* (TRAM_RAM963) TrustRAM Offset */
#define TRAM_RAM964_REG_OFST           _UINT32_(0x1F10)    /* (TRAM_RAM964) TrustRAM Offset */
#define TRAM_RAM965_REG_OFST           _UINT32_(0x1F14)    /* (TRAM_RAM965) TrustRAM Offset */
#define TRAM_RAM966_REG_OFST           _UINT32_(0x1F18)    /* (TRAM_RAM966) TrustRAM Offset */
#define TRAM_RAM967_REG_OFST           _UINT32_(0x1F1C)    /* (TRAM_RAM967) TrustRAM Offset */
#define TRAM_RAM968_REG_OFST           _UINT32_(0x1F20)    /* (TRAM_RAM968) TrustRAM Offset */
#define TRAM_RAM969_REG_OFST           _UINT32_(0x1F24)    /* (TRAM_RAM969) TrustRAM Offset */
#define TRAM_RAM970_REG_OFST           _UINT32_(0x1F28)    /* (TRAM_RAM970) TrustRAM Offset */
#define TRAM_RAM971_REG_OFST           _UINT32_(0x1F2C)    /* (TRAM_RAM971) TrustRAM Offset */
#define TRAM_RAM972_REG_OFST           _UINT32_(0x1F30)    /* (TRAM_RAM972) TrustRAM Offset */
#define TRAM_RAM973_REG_OFST           _UINT32_(0x1F34)    /* (TRAM_RAM973) TrustRAM Offset */
#define TRAM_RAM974_REG_OFST           _UINT32_(0x1F38)    /* (TRAM_RAM974) TrustRAM Offset */
#define TRAM_RAM975_REG_OFST           _UINT32_(0x1F3C)    /* (TRAM_RAM975) TrustRAM Offset */
#define TRAM_RAM976_REG_OFST           _UINT32_(0x1F40)    /* (TRAM_RAM976) TrustRAM Offset */
#define TRAM_RAM977_REG_OFST           _UINT32_(0x1F44)    /* (TRAM_RAM977) TrustRAM Offset */
#define TRAM_RAM978_REG_OFST           _UINT32_(0x1F48)    /* (TRAM_RAM978) TrustRAM Offset */
#define TRAM_RAM979_REG_OFST           _UINT32_(0x1F4C)    /* (TRAM_RAM979) TrustRAM Offset */
#define TRAM_RAM980_REG_OFST           _UINT32_(0x1F50)    /* (TRAM_RAM980) TrustRAM Offset */
#define TRAM_RAM981_REG_OFST           _UINT32_(0x1F54)    /* (TRAM_RAM981) TrustRAM Offset */
#define TRAM_RAM982_REG_OFST           _UINT32_(0x1F58)    /* (TRAM_RAM982) TrustRAM Offset */
#define TRAM_RAM983_REG_OFST           _UINT32_(0x1F5C)    /* (TRAM_RAM983) TrustRAM Offset */
#define TRAM_RAM984_REG_OFST           _UINT32_(0x1F60)    /* (TRAM_RAM984) TrustRAM Offset */
#define TRAM_RAM985_REG_OFST           _UINT32_(0x1F64)    /* (TRAM_RAM985) TrustRAM Offset */
#define TRAM_RAM986_REG_OFST           _UINT32_(0x1F68)    /* (TRAM_RAM986) TrustRAM Offset */
#define TRAM_RAM987_REG_OFST           _UINT32_(0x1F6C)    /* (TRAM_RAM987) TrustRAM Offset */
#define TRAM_RAM988_REG_OFST           _UINT32_(0x1F70)    /* (TRAM_RAM988) TrustRAM Offset */
#define TRAM_RAM989_REG_OFST           _UINT32_(0x1F74)    /* (TRAM_RAM989) TrustRAM Offset */
#define TRAM_RAM990_REG_OFST           _UINT32_(0x1F78)    /* (TRAM_RAM990) TrustRAM Offset */
#define TRAM_RAM991_REG_OFST           _UINT32_(0x1F7C)    /* (TRAM_RAM991) TrustRAM Offset */
#define TRAM_RAM992_REG_OFST           _UINT32_(0x1F80)    /* (TRAM_RAM992) TrustRAM Offset */
#define TRAM_RAM993_REG_OFST           _UINT32_(0x1F84)    /* (TRAM_RAM993) TrustRAM Offset */
#define TRAM_RAM994_REG_OFST           _UINT32_(0x1F88)    /* (TRAM_RAM994) TrustRAM Offset */
#define TRAM_RAM995_REG_OFST           _UINT32_(0x1F8C)    /* (TRAM_RAM995) TrustRAM Offset */
#define TRAM_RAM996_REG_OFST           _UINT32_(0x1F90)    /* (TRAM_RAM996) TrustRAM Offset */
#define TRAM_RAM997_REG_OFST           _UINT32_(0x1F94)    /* (TRAM_RAM997) TrustRAM Offset */
