Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/tram.h
#define TRAM_RAM998_REG_OFST           _UINT32_(0x1F98)    /* (TRAM_RAM998) TrustRAM Offset */
#define TRAM_RAM999_REG_OFST           _UINT32_(0x1F9C)    /* (TRAM_RAM999) TrustRAM Offset */
#define TRAM_RAM1000_REG_OFST          _UINT32_(0x1FA0)    /* (TRAM_RAM1000) TrustRAM Offset */
#define TRAM_RAM1001_REG_OFST          _UINT32_(0x1FA4)    /* (TRAM_RAM1001) TrustRAM Offset */
#define TRAM_RAM1002_REG_OFST          _UINT32_(0x1FA8)    /* (TRAM_RAM1002) TrustRAM Offset */
#define TRAM_RAM1003_REG_OFST          _UINT32_(0x1FAC)    /* (TRAM_RAM1003) TrustRAM Offset */
#define TRAM_RAM1004_REG_OFST          _UINT32_(0x1FB0)    /* (TRAM_RAM1004) TrustRAM Offset */
#define TRAM_RAM1005_REG_OFST          _UINT32_(0x1FB4)    /* (TRAM_RAM1005) TrustRAM Offset */
#define TRAM_RAM1006_REG_OFST          _UINT32_(0x1FB8)    /* (TRAM_RAM1006) TrustRAM Offset */
#define TRAM_RAM1007_REG_OFST          _UINT32_(0x1FBC)    /* (TRAM_RAM1007) TrustRAM Offset */
#define TRAM_RAM1008_REG_OFST          _UINT32_(0x1FC0)    /* (TRAM_RAM1008) TrustRAM Offset */
#define TRAM_RAM1009_REG_OFST          _UINT32_(0x1FC4)    /* (TRAM_RAM1009) TrustRAM Offset */
#define TRAM_RAM1010_REG_OFST          _UINT32_(0x1FC8)    /* (TRAM_RAM1010) TrustRAM Offset */
#define TRAM_RAM1011_REG_OFST          _UINT32_(0x1FCC)    /* (TRAM_RAM1011) TrustRAM Offset */
#define TRAM_RAM1012_REG_OFST          _UINT32_(0x1FD0)    /* (TRAM_RAM1012) TrustRAM Offset */
#define TRAM_RAM1013_REG_OFST          _UINT32_(0x1FD4)    /* (TRAM_RAM1013) TrustRAM Offset */
#define TRAM_RAM1014_REG_OFST          _UINT32_(0x1FD8)    /* (TRAM_RAM1014) TrustRAM Offset */
#define TRAM_RAM1015_REG_OFST          _UINT32_(0x1FDC)    /* (TRAM_RAM1015) TrustRAM Offset */
#define TRAM_RAM1016_REG_OFST          _UINT32_(0x1FE0)    /* (TRAM_RAM1016) TrustRAM Offset */
#define TRAM_RAM1017_REG_OFST          _UINT32_(0x1FE4)    /* (TRAM_RAM1017) TrustRAM Offset */
#define TRAM_RAM1018_REG_OFST          _UINT32_(0x1FE8)    /* (TRAM_RAM1018) TrustRAM Offset */
#define TRAM_RAM1019_REG_OFST          _UINT32_(0x1FEC)    /* (TRAM_RAM1019) TrustRAM Offset */
#define TRAM_RAM1020_REG_OFST          _UINT32_(0x1FF0)    /* (TRAM_RAM1020) TrustRAM Offset */
#define TRAM_RAM1021_REG_OFST          _UINT32_(0x1FF4)    /* (TRAM_RAM1021) TrustRAM Offset */
#define TRAM_RAM1022_REG_OFST          _UINT32_(0x1FF8)    /* (TRAM_RAM1022) TrustRAM Offset */
#define TRAM_RAM1023_REG_OFST          _UINT32_(0x1FFC)    /* (TRAM_RAM1023) TrustRAM Offset */
#define TRAM_RAM1024_REG_OFST          _UINT32_(0x2000)    /* (TRAM_RAM1024) TrustRAM Offset */
#define TRAM_RAM1025_REG_OFST          _UINT32_(0x2004)    /* (TRAM_RAM1025) TrustRAM Offset */
#define TRAM_RAM1026_REG_OFST          _UINT32_(0x2008)    /* (TRAM_RAM1026) TrustRAM Offset */
#define TRAM_RAM1027_REG_OFST          _UINT32_(0x200C)    /* (TRAM_RAM1027) TrustRAM Offset */
#define TRAM_RAM1028_REG_OFST          _UINT32_(0x2010)    /* (TRAM_RAM1028) TrustRAM Offset */
#define TRAM_RAM1029_REG_OFST          _UINT32_(0x2014)    /* (TRAM_RAM1029) TrustRAM Offset */
#define TRAM_RAM1030_REG_OFST          _UINT32_(0x2018)    /* (TRAM_RAM1030) TrustRAM Offset */
#define TRAM_RAM1031_REG_OFST          _UINT32_(0x201C)    /* (TRAM_RAM1031) TrustRAM Offset */
#define TRAM_RAM1032_REG_OFST          _UINT32_(0x2020)    /* (TRAM_RAM1032) TrustRAM Offset */
#define TRAM_RAM1033_REG_OFST          _UINT32_(0x2024)    /* (TRAM_RAM1033) TrustRAM Offset */
#define TRAM_RAM1034_REG_OFST          _UINT32_(0x2028)    /* (TRAM_RAM1034) TrustRAM Offset */
#define TRAM_RAM1035_REG_OFST          _UINT32_(0x202C)    /* (TRAM_RAM1035) TrustRAM Offset */
#define TRAM_RAM1036_REG_OFST          _UINT32_(0x2030)    /* (TRAM_RAM1036) TrustRAM Offset */
#define TRAM_RAM1037_REG_OFST          _UINT32_(0x2034)    /* (TRAM_RAM1037) TrustRAM Offset */
#define TRAM_RAM1038_REG_OFST          _UINT32_(0x2038)    /* (TRAM_RAM1038) TrustRAM Offset */
#define TRAM_RAM1039_REG_OFST          _UINT32_(0x203C)    /* (TRAM_RAM1039) TrustRAM Offset */
#define TRAM_RAM1040_REG_OFST          _UINT32_(0x2040)    /* (TRAM_RAM1040) TrustRAM Offset */
#define TRAM_RAM1041_REG_OFST          _UINT32_(0x2044)    /* (TRAM_RAM1041) TrustRAM Offset */
#define TRAM_RAM1042_REG_OFST          _UINT32_(0x2048)    /* (TRAM_RAM1042) TrustRAM Offset */
#define TRAM_RAM1043_REG_OFST          _UINT32_(0x204C)    /* (TRAM_RAM1043) TrustRAM Offset */
#define TRAM_RAM1044_REG_OFST          _UINT32_(0x2050)    /* (TRAM_RAM1044) TrustRAM Offset */
#define TRAM_RAM1045_REG_OFST          _UINT32_(0x2054)    /* (TRAM_RAM1045) TrustRAM Offset */
#define TRAM_RAM1046_REG_OFST          _UINT32_(0x2058)    /* (TRAM_RAM1046) TrustRAM Offset */
#define TRAM_RAM1047_REG_OFST          _UINT32_(0x205C)    /* (TRAM_RAM1047) TrustRAM Offset */
#define TRAM_RAM1048_REG_OFST          _UINT32_(0x2060)    /* (TRAM_RAM1048) TrustRAM Offset */
#define TRAM_RAM1049_REG_OFST          _UINT32_(0x2064)    /* (TRAM_RAM1049) TrustRAM Offset */
#define TRAM_RAM1050_REG_OFST          _UINT32_(0x2068)    /* (TRAM_RAM1050) TrustRAM Offset */
#define TRAM_RAM1051_REG_OFST          _UINT32_(0x206C)    /* (TRAM_RAM1051) TrustRAM Offset */
#define TRAM_RAM1052_REG_OFST          _UINT32_(0x2070)    /* (TRAM_RAM1052) TrustRAM Offset */
#define TRAM_RAM1053_REG_OFST          _UINT32_(0x2074)    /* (TRAM_RAM1053) TrustRAM Offset */
#define TRAM_RAM1054_REG_OFST          _UINT32_(0x2078)    /* (TRAM_RAM1054) TrustRAM Offset */
#define TRAM_RAM1055_REG_OFST          _UINT32_(0x207C)    /* (TRAM_RAM1055) TrustRAM Offset */
#define TRAM_RAM1056_REG_OFST          _UINT32_(0x2080)    /* (TRAM_RAM1056) TrustRAM Offset */
#define TRAM_RAM1057_REG_OFST          _UINT32_(0x2084)    /* (TRAM_RAM1057) TrustRAM Offset */
#define TRAM_RAM1058_REG_OFST          _UINT32_(0x2088)    /* (TRAM_RAM1058) TrustRAM Offset */
#define TRAM_RAM1059_REG_OFST          _UINT32_(0x208C)    /* (TRAM_RAM1059) TrustRAM Offset */
#define TRAM_RAM1060_REG_OFST          _UINT32_(0x2090)    /* (TRAM_RAM1060) TrustRAM Offset */
#define TRAM_RAM1061_REG_OFST          _UINT32_(0x2094)    /* (TRAM_RAM1061) TrustRAM Offset */
#define TRAM_RAM1062_REG_OFST          _UINT32_(0x2098)    /* (TRAM_RAM1062) TrustRAM Offset */
#define TRAM_RAM1063_REG_OFST          _UINT32_(0x209C)    /* (TRAM_RAM1063) TrustRAM Offset */
#define TRAM_RAM1064_REG_OFST          _UINT32_(0x20A0)    /* (TRAM_RAM1064) TrustRAM Offset */
#define TRAM_RAM1065_REG_OFST          _UINT32_(0x20A4)    /* (TRAM_RAM1065) TrustRAM Offset */
#define TRAM_RAM1066_REG_OFST          _UINT32_(0x20A8)    /* (TRAM_RAM1066) TrustRAM Offset */
#define TRAM_RAM1067_REG_OFST          _UINT32_(0x20AC)    /* (TRAM_RAM1067) TrustRAM Offset */
#define TRAM_RAM1068_REG_OFST          _UINT32_(0x20B0)    /* (TRAM_RAM1068) TrustRAM Offset */
#define TRAM_RAM1069_REG_OFST          _UINT32_(0x20B4)    /* (TRAM_RAM1069) TrustRAM Offset */
#define TRAM_RAM1070_REG_OFST          _UINT32_(0x20B8)    /* (TRAM_RAM1070) TrustRAM Offset */
#define TRAM_RAM1071_REG_OFST          _UINT32_(0x20BC)    /* (TRAM_RAM1071) TrustRAM Offset */
#define TRAM_RAM1072_REG_OFST          _UINT32_(0x20C0)    /* (TRAM_RAM1072) TrustRAM Offset */
#define TRAM_RAM1073_REG_OFST          _UINT32_(0x20C4)    /* (TRAM_RAM1073) TrustRAM Offset */
#define TRAM_RAM1074_REG_OFST          _UINT32_(0x20C8)    /* (TRAM_RAM1074) TrustRAM Offset */
#define TRAM_RAM1075_REG_OFST          _UINT32_(0x20CC)    /* (TRAM_RAM1075) TrustRAM Offset */
#define TRAM_RAM1076_REG_OFST          _UINT32_(0x20D0)    /* (TRAM_RAM1076) TrustRAM Offset */
#define TRAM_RAM1077_REG_OFST          _UINT32_(0x20D4)    /* (TRAM_RAM1077) TrustRAM Offset */
#define TRAM_RAM1078_REG_OFST          _UINT32_(0x20D8)    /* (TRAM_RAM1078) TrustRAM Offset */
#define TRAM_RAM1079_REG_OFST          _UINT32_(0x20DC)    /* (TRAM_RAM1079) TrustRAM Offset */
#define TRAM_RAM1080_REG_OFST          _UINT32_(0x20E0)    /* (TRAM_RAM1080) TrustRAM Offset */
#define TRAM_RAM1081_REG_OFST          _UINT32_(0x20E4)    /* (TRAM_RAM1081) TrustRAM Offset */
#define TRAM_RAM1082_REG_OFST          _UINT32_(0x20E8)    /* (TRAM_RAM1082) TrustRAM Offset */
#define TRAM_RAM1083_REG_OFST          _UINT32_(0x20EC)    /* (TRAM_RAM1083) TrustRAM Offset */
#define TRAM_RAM1084_REG_OFST          _UINT32_(0x20F0)    /* (TRAM_RAM1084) TrustRAM Offset */
#define TRAM_RAM1085_REG_OFST          _UINT32_(0x20F4)    /* (TRAM_RAM1085) TrustRAM Offset */
#define TRAM_RAM1086_REG_OFST          _UINT32_(0x20F8)    /* (TRAM_RAM1086) TrustRAM Offset */
#define TRAM_RAM1087_REG_OFST          _UINT32_(0x20FC)    /* (TRAM_RAM1087) TrustRAM Offset */
#define TRAM_RAM1088_REG_OFST          _UINT32_(0x2100)    /* (TRAM_RAM1088) TrustRAM Offset */
#define TRAM_RAM1089_REG_OFST          _UINT32_(0x2104)    /* (TRAM_RAM1089) TrustRAM Offset */
#define TRAM_RAM1090_REG_OFST          _UINT32_(0x2108)    /* (TRAM_RAM1090) TrustRAM Offset */
#define TRAM_RAM1091_REG_OFST          _UINT32_(0x210C)    /* (TRAM_RAM1091) TrustRAM Offset */
#define TRAM_RAM1092_REG_OFST          _UINT32_(0x2110)    /* (TRAM_RAM1092) TrustRAM Offset */
#define TRAM_RAM1093_REG_OFST          _UINT32_(0x2114)    /* (TRAM_RAM1093) TrustRAM Offset */
#define TRAM_RAM1094_REG_OFST          _UINT32_(0x2118)    /* (TRAM_RAM1094) TrustRAM Offset */
#define TRAM_RAM1095_REG_OFST          _UINT32_(0x211C)    /* (TRAM_RAM1095) TrustRAM Offset */
#define TRAM_RAM1096_REG_OFST          _UINT32_(0x2120)    /* (TRAM_RAM1096) TrustRAM Offset */
#define TRAM_RAM1097_REG_OFST          _UINT32_(0x2124)    /* (TRAM_RAM1097) TrustRAM Offset */
#define TRAM_RAM1098_REG_OFST          _UINT32_(0x2128)    /* (TRAM_RAM1098) TrustRAM Offset */
#define TRAM_RAM1099_REG_OFST          _UINT32_(0x212C)    /* (TRAM_RAM1099) TrustRAM Offset */
#define TRAM_RAM1100_REG_OFST          _UINT32_(0x2130)    /* (TRAM_RAM1100) TrustRAM Offset */
#define TRAM_RAM1101_REG_OFST          _UINT32_(0x2134)    /* (TRAM_RAM1101) TrustRAM Offset */
#define TRAM_RAM1102_REG_OFST          _UINT32_(0x2138)    /* (TRAM_RAM1102) TrustRAM Offset */
#define TRAM_RAM1103_REG_OFST          _UINT32_(0x213C)    /* (TRAM_RAM1103) TrustRAM Offset */
#define TRAM_RAM1104_REG_OFST          _UINT32_(0x2140)    /* (TRAM_RAM1104) TrustRAM Offset */
#define TRAM_RAM1105_REG_OFST          _UINT32_(0x2144)    /* (TRAM_RAM1105) TrustRAM Offset */
#define TRAM_RAM1106_REG_OFST          _UINT32_(0x2148)    /* (TRAM_RAM1106) TrustRAM Offset */
#define TRAM_RAM1107_REG_OFST          _UINT32_(0x214C)    /* (TRAM_RAM1107) TrustRAM Offset */
#define TRAM_RAM1108_REG_OFST          _UINT32_(0x2150)    /* (TRAM_RAM1108) TrustRAM Offset */
#define TRAM_RAM1109_REG_OFST          _UINT32_(0x2154)    /* (TRAM_RAM1109) TrustRAM Offset */
#define TRAM_RAM1110_REG_OFST          _UINT32_(0x2158)    /* (TRAM_RAM1110) TrustRAM Offset */
#define TRAM_RAM1111_REG_OFST          _UINT32_(0x215C)    /* (TRAM_RAM1111) TrustRAM Offset */
#define TRAM_RAM1112_REG_OFST          _UINT32_(0x2160)    /* (TRAM_RAM1112) TrustRAM Offset */
#define TRAM_RAM1113_REG_OFST          _UINT32_(0x2164)    /* (TRAM_RAM1113) TrustRAM Offset */
#define TRAM_RAM1114_REG_OFST          _UINT32_(0x2168)    /* (TRAM_RAM1114) TrustRAM Offset */
#define TRAM_RAM1115_REG_OFST          _UINT32_(0x216C)    /* (TRAM_RAM1115) TrustRAM Offset */
#define TRAM_RAM1116_REG_OFST          _UINT32_(0x2170)    /* (TRAM_RAM1116) TrustRAM Offset */
#define TRAM_RAM1117_REG_OFST          _UINT32_(0x2174)    /* (TRAM_RAM1117) TrustRAM Offset */
#define TRAM_RAM1118_REG_OFST          _UINT32_(0x2178)    /* (TRAM_RAM1118) TrustRAM Offset */
#define TRAM_RAM1119_REG_OFST          _UINT32_(0x217C)    /* (TRAM_RAM1119) TrustRAM Offset */
#define TRAM_RAM1120_REG_OFST          _UINT32_(0x2180)    /* (TRAM_RAM1120) TrustRAM Offset */
#define TRAM_RAM1121_REG_OFST          _UINT32_(0x2184)    /* (TRAM_RAM1121) TrustRAM Offset */
#define TRAM_RAM1122_REG_OFST          _UINT32_(0x2188)    /* (TRAM_RAM1122) TrustRAM Offset */
#define TRAM_RAM1123_REG_OFST          _UINT32_(0x218C)    /* (TRAM_RAM1123) TrustRAM Offset */
#define TRAM_RAM1124_REG_OFST          _UINT32_(0x2190)    /* (TRAM_RAM1124) TrustRAM Offset */
#define TRAM_RAM1125_REG_OFST          _UINT32_(0x2194)    /* (TRAM_RAM1125) TrustRAM Offset */
#define TRAM_RAM1126_REG_OFST          _UINT32_(0x2198)    /* (TRAM_RAM1126) TrustRAM Offset */
#define TRAM_RAM1127_REG_OFST          _UINT32_(0x219C)    /* (TRAM_RAM1127) TrustRAM Offset */
#define TRAM_RAM1128_REG_OFST          _UINT32_(0x21A0)    /* (TRAM_RAM1128) TrustRAM Offset */
#define TRAM_RAM1129_REG_OFST          _UINT32_(0x21A4)    /* (TRAM_RAM1129) TrustRAM Offset */
#define TRAM_RAM1130_REG_OFST          _UINT32_(0x21A8)    /* (TRAM_RAM1130) TrustRAM Offset */
#define TRAM_RAM1131_REG_OFST          _UINT32_(0x21AC)    /* (TRAM_RAM1131) TrustRAM Offset */
#define TRAM_RAM1132_REG_OFST          _UINT32_(0x21B0)    /* (TRAM_RAM1132) TrustRAM Offset */
#define TRAM_RAM1133_REG_OFST          _UINT32_(0x21B4)    /* (TRAM_RAM1133) TrustRAM Offset */
#define TRAM_RAM1134_REG_OFST          _UINT32_(0x21B8)    /* (TRAM_RAM1134) TrustRAM Offset */
#define TRAM_RAM1135_REG_OFST          _UINT32_(0x21BC)    /* (TRAM_RAM1135) TrustRAM Offset */
#define TRAM_RAM1136_REG_OFST          _UINT32_(0x21C0)    /* (TRAM_RAM1136) TrustRAM Offset */
#define TRAM_RAM1137_REG_OFST          _UINT32_(0x21C4)    /* (TRAM_RAM1137) TrustRAM Offset */
#define TRAM_RAM1138_REG_OFST          _UINT32_(0x21C8)    /* (TRAM_RAM1138) TrustRAM Offset */
#define TRAM_RAM1139_REG_OFST          _UINT32_(0x21CC)    /* (TRAM_RAM1139) TrustRAM Offset */
#define TRAM_RAM1140_REG_OFST          _UINT32_(0x21D0)    /* (TRAM_RAM1140) TrustRAM Offset */
#define TRAM_RAM1141_REG_OFST          _UINT32_(0x21D4)    /* (TRAM_RAM1141) TrustRAM Offset */
#define TRAM_RAM1142_REG_OFST          _UINT32_(0x21D8)    /* (TRAM_RAM1142) TrustRAM Offset */
#define TRAM_RAM1143_REG_OFST          _UINT32_(0x21DC)    /* (TRAM_RAM1143) TrustRAM Offset */
#define TRAM_RAM1144_REG_OFST          _UINT32_(0x21E0)    /* (TRAM_RAM1144) TrustRAM Offset */
#define TRAM_RAM1145_REG_OFST          _UINT32_(0x21E4)    /* (TRAM_RAM1145) TrustRAM Offset */
#define TRAM_RAM1146_REG_OFST          _UINT32_(0x21E8)    /* (TRAM_RAM1146) TrustRAM Offset */
#define TRAM_RAM1147_REG_OFST          _UINT32_(0x21EC)    /* (TRAM_RAM1147) TrustRAM Offset */
#define TRAM_RAM1148_REG_OFST          _UINT32_(0x21F0)    /* (TRAM_RAM1148) TrustRAM Offset */
#define TRAM_RAM1149_REG_OFST          _UINT32_(0x21F4)    /* (TRAM_RAM1149) TrustRAM Offset */
#define TRAM_RAM1150_REG_OFST          _UINT32_(0x21F8)    /* (TRAM_RAM1150) TrustRAM Offset */
#define TRAM_RAM1151_REG_OFST          _UINT32_(0x21FC)    /* (TRAM_RAM1151) TrustRAM Offset */
#define TRAM_RAM1152_REG_OFST          _UINT32_(0x2200)    /* (TRAM_RAM1152) TrustRAM Offset */
#define TRAM_RAM1153_REG_OFST          _UINT32_(0x2204)    /* (TRAM_RAM1153) TrustRAM Offset */
#define TRAM_RAM1154_REG_OFST          _UINT32_(0x2208)    /* (TRAM_RAM1154) TrustRAM Offset */
#define TRAM_RAM1155_REG_OFST          _UINT32_(0x220C)    /* (TRAM_RAM1155) TrustRAM Offset */
#define TRAM_RAM1156_REG_OFST          _UINT32_(0x2210)    /* (TRAM_RAM1156) TrustRAM Offset */
#define TRAM_RAM1157_REG_OFST          _UINT32_(0x2214)    /* (TRAM_RAM1157) TrustRAM Offset */
#define TRAM_RAM1158_REG_OFST          _UINT32_(0x2218)    /* (TRAM_RAM1158) TrustRAM Offset */
#define TRAM_RAM1159_REG_OFST          _UINT32_(0x221C)    /* (TRAM_RAM1159) TrustRAM Offset */
#define TRAM_RAM1160_REG_OFST          _UINT32_(0x2220)    /* (TRAM_RAM1160) TrustRAM Offset */
#define TRAM_RAM1161_REG_OFST          _UINT32_(0x2224)    /* (TRAM_RAM1161) TrustRAM Offset */
#define TRAM_RAM1162_REG_OFST          _UINT32_(0x2228)    /* (TRAM_RAM1162) TrustRAM Offset */
#define TRAM_RAM1163_REG_OFST          _UINT32_(0x222C)    /* (TRAM_RAM1163) TrustRAM Offset */
#define TRAM_RAM1164_REG_OFST          _UINT32_(0x2230)    /* (TRAM_RAM1164) TrustRAM Offset */
#define TRAM_RAM1165_REG_OFST          _UINT32_(0x2234)    /* (TRAM_RAM1165) TrustRAM Offset */
#define TRAM_RAM1166_REG_OFST          _UINT32_(0x2238)    /* (TRAM_RAM1166) TrustRAM Offset */
#define TRAM_RAM1167_REG_OFST          _UINT32_(0x223C)    /* (TRAM_RAM1167) TrustRAM Offset */
#define TRAM_RAM1168_REG_OFST          _UINT32_(0x2240)    /* (TRAM_RAM1168) TrustRAM Offset */
#define TRAM_RAM1169_REG_OFST          _UINT32_(0x2244)    /* (TRAM_RAM1169) TrustRAM Offset */
#define TRAM_RAM1170_REG_OFST          _UINT32_(0x2248)    /* (TRAM_RAM1170) TrustRAM Offset */
#define TRAM_RAM1171_REG_OFST          _UINT32_(0x224C)    /* (TRAM_RAM1171) TrustRAM Offset */
#define TRAM_RAM1172_REG_OFST          _UINT32_(0x2250)    /* (TRAM_RAM1172) TrustRAM Offset */
#define TRAM_RAM1173_REG_OFST          _UINT32_(0x2254)    /* (TRAM_RAM1173) TrustRAM Offset */
#define TRAM_RAM1174_REG_OFST          _UINT32_(0x2258)    /* (TRAM_RAM1174) TrustRAM Offset */
#define TRAM_RAM1175_REG_OFST          _UINT32_(0x225C)    /* (TRAM_RAM1175) TrustRAM Offset */
#define TRAM_RAM1176_REG_OFST          _UINT32_(0x2260)    /* (TRAM_RAM1176) TrustRAM Offset */
#define TRAM_RAM1177_REG_OFST          _UINT32_(0x2264)    /* (TRAM_RAM1177) TrustRAM Offset */
#define TRAM_RAM1178_REG_OFST          _UINT32_(0x2268)    /* (TRAM_RAM1178) TrustRAM Offset */
#define TRAM_RAM1179_REG_OFST          _UINT32_(0x226C)    /* (TRAM_RAM1179) TrustRAM Offset */
#define TRAM_RAM1180_REG_OFST          _UINT32_(0x2270)    /* (TRAM_RAM1180) TrustRAM Offset */
#define TRAM_RAM1181_REG_OFST          _UINT32_(0x2274)    /* (TRAM_RAM1181) TrustRAM Offset */
#define TRAM_RAM1182_REG_OFST          _UINT32_(0x2278)    /* (TRAM_RAM1182) TrustRAM Offset */
#define TRAM_RAM1183_REG_OFST          _UINT32_(0x227C)    /* (TRAM_RAM1183) TrustRAM Offset */
#define TRAM_RAM1184_REG_OFST          _UINT32_(0x2280)    /* (TRAM_RAM1184) TrustRAM Offset */
#define TRAM_RAM1185_REG_OFST          _UINT32_(0x2284)    /* (TRAM_RAM1185) TrustRAM Offset */
#define TRAM_RAM1186_REG_OFST          _UINT32_(0x2288)    /* (TRAM_RAM1186) TrustRAM Offset */
#define TRAM_RAM1187_REG_OFST          _UINT32_(0x228C)    /* (TRAM_RAM1187) TrustRAM Offset */
#define TRAM_RAM1188_REG_OFST          _UINT32_(0x2290)    /* (TRAM_RAM1188) TrustRAM Offset */
#define TRAM_RAM1189_REG_OFST          _UINT32_(0x2294)    /* (TRAM_RAM1189) TrustRAM Offset */
#define TRAM_RAM1190_REG_OFST          _UINT32_(0x2298)    /* (TRAM_RAM1190) TrustRAM Offset */
#define TRAM_RAM1191_REG_OFST          _UINT32_(0x229C)    /* (TRAM_RAM1191) TrustRAM Offset */
#define TRAM_RAM1192_REG_OFST          _UINT32_(0x22A0)    /* (TRAM_RAM1192) TrustRAM Offset */
#define TRAM_RAM1193_REG_OFST          _UINT32_(0x22A4)    /* (TRAM_RAM1193) TrustRAM Offset */
#define TRAM_RAM1194_REG_OFST          _UINT32_(0x22A8)    /* (TRAM_RAM1194) TrustRAM Offset */
#define TRAM_RAM1195_REG_OFST          _UINT32_(0x22AC)    /* (TRAM_RAM1195) TrustRAM Offset */
#define TRAM_RAM1196_REG_OFST          _UINT32_(0x22B0)    /* (TRAM_RAM1196) TrustRAM Offset */
#define TRAM_RAM1197_REG_OFST          _UINT32_(0x22B4)    /* (TRAM_RAM1197) TrustRAM Offset */
#define TRAM_RAM1198_REG_OFST          _UINT32_(0x22B8)    /* (TRAM_RAM1198) TrustRAM Offset */
#define TRAM_RAM1199_REG_OFST          _UINT32_(0x22BC)    /* (TRAM_RAM1199) TrustRAM Offset */
#define TRAM_RAM1200_REG_OFST          _UINT32_(0x22C0)    /* (TRAM_RAM1200) TrustRAM Offset */
#define TRAM_RAM1201_REG_OFST          _UINT32_(0x22C4)    /* (TRAM_RAM1201) TrustRAM Offset */
#define TRAM_RAM1202_REG_OFST          _UINT32_(0x22C8)    /* (TRAM_RAM1202) TrustRAM Offset */
#define TRAM_RAM1203_REG_OFST          _UINT32_(0x22CC)    /* (TRAM_RAM1203) TrustRAM Offset */
#define TRAM_RAM1204_REG_OFST          _UINT32_(0x22D0)    /* (TRAM_RAM1204) TrustRAM Offset */
#define TRAM_RAM1205_REG_OFST          _UINT32_(0x22D4)    /* (TRAM_RAM1205) TrustRAM Offset */
#define TRAM_RAM1206_REG_OFST          _UINT32_(0x22D8)    /* (TRAM_RAM1206) TrustRAM Offset */
#define TRAM_RAM1207_REG_OFST          _UINT32_(0x22DC)    /* (TRAM_RAM1207) TrustRAM Offset */
#define TRAM_RAM1208_REG_OFST          _UINT32_(0x22E0)    /* (TRAM_RAM1208) TrustRAM Offset */
#define TRAM_RAM1209_REG_OFST          _UINT32_(0x22E4)    /* (TRAM_RAM1209) TrustRAM Offset */
#define TRAM_RAM1210_REG_OFST          _UINT32_(0x22E8)    /* (TRAM_RAM1210) TrustRAM Offset */
#define TRAM_RAM1211_REG_OFST          _UINT32_(0x22EC)    /* (TRAM_RAM1211) TrustRAM Offset */
#define TRAM_RAM1212_REG_OFST          _UINT32_(0x22F0)    /* (TRAM_RAM1212) TrustRAM Offset */
#define TRAM_RAM1213_REG_OFST          _UINT32_(0x22F4)    /* (TRAM_RAM1213) TrustRAM Offset */
#define TRAM_RAM1214_REG_OFST          _UINT32_(0x22F8)    /* (TRAM_RAM1214) TrustRAM Offset */
#define TRAM_RAM1215_REG_OFST          _UINT32_(0x22FC)    /* (TRAM_RAM1215) TrustRAM Offset */
#define TRAM_RAM1216_REG_OFST          _UINT32_(0x2300)    /* (TRAM_RAM1216) TrustRAM Offset */
#define TRAM_RAM1217_REG_OFST          _UINT32_(0x2304)    /* (TRAM_RAM1217) TrustRAM Offset */
#define TRAM_RAM1218_REG_OFST          _UINT32_(0x2308)    /* (TRAM_RAM1218) TrustRAM Offset */
#define TRAM_RAM1219_REG_OFST          _UINT32_(0x230C)    /* (TRAM_RAM1219) TrustRAM Offset */
#define TRAM_RAM1220_REG_OFST          _UINT32_(0x2310)    /* (TRAM_RAM1220) TrustRAM Offset */
#define TRAM_RAM1221_REG_OFST          _UINT32_(0x2314)    /* (TRAM_RAM1221) TrustRAM Offset */
#define TRAM_RAM1222_REG_OFST          _UINT32_(0x2318)    /* (TRAM_RAM1222) TrustRAM Offset */
#define TRAM_RAM1223_REG_OFST          _UINT32_(0x231C)    /* (TRAM_RAM1223) TrustRAM Offset */
#define TRAM_RAM1224_REG_OFST          _UINT32_(0x2320)    /* (TRAM_RAM1224) TrustRAM Offset */
#define TRAM_RAM1225_REG_OFST          _UINT32_(0x2324)    /* (TRAM_RAM1225) TrustRAM Offset */
#define TRAM_RAM1226_REG_OFST          _UINT32_(0x2328)    /* (TRAM_RAM1226) TrustRAM Offset */
#define TRAM_RAM1227_REG_OFST          _UINT32_(0x232C)    /* (TRAM_RAM1227) TrustRAM Offset */
#define TRAM_RAM1228_REG_OFST          _UINT32_(0x2330)    /* (TRAM_RAM1228) TrustRAM Offset */
#define TRAM_RAM1229_REG_OFST          _UINT32_(0x2334)    /* (TRAM_RAM1229) TrustRAM Offset */
#define TRAM_RAM1230_REG_OFST          _UINT32_(0x2338)    /* (TRAM_RAM1230) TrustRAM Offset */
#define TRAM_RAM1231_REG_OFST          _UINT32_(0x233C)    /* (TRAM_RAM1231) TrustRAM Offset */
#define TRAM_RAM1232_REG_OFST          _UINT32_(0x2340)    /* (TRAM_RAM1232) TrustRAM Offset */
#define TRAM_RAM1233_REG_OFST          _UINT32_(0x2344)    /* (TRAM_RAM1233) TrustRAM Offset */
#define TRAM_RAM1234_REG_OFST          _UINT32_(0x2348)    /* (TRAM_RAM1234) TrustRAM Offset */
#define TRAM_RAM1235_REG_OFST          _UINT32_(0x234C)    /* (TRAM_RAM1235) TrustRAM Offset */
#define TRAM_RAM1236_REG_OFST          _UINT32_(0x2350)    /* (TRAM_RAM1236) TrustRAM Offset */
#define TRAM_RAM1237_REG_OFST          _UINT32_(0x2354)    /* (TRAM_RAM1237) TrustRAM Offset */
#define TRAM_RAM1238_REG_OFST          _UINT32_(0x2358)    /* (TRAM_RAM1238) TrustRAM Offset */
#define TRAM_RAM1239_REG_OFST          _UINT32_(0x235C)    /* (TRAM_RAM1239) TrustRAM Offset */
#define TRAM_RAM1240_REG_OFST          _UINT32_(0x2360)    /* (TRAM_RAM1240) TrustRAM Offset */
#define TRAM_RAM1241_REG_OFST          _UINT32_(0x2364)    /* (TRAM_RAM1241) TrustRAM Offset */
#define TRAM_RAM1242_REG_OFST          _UINT32_(0x2368)    /* (TRAM_RAM1242) TrustRAM Offset */
#define TRAM_RAM1243_REG_OFST          _UINT32_(0x236C)    /* (TRAM_RAM1243) TrustRAM Offset */
#define TRAM_RAM1244_REG_OFST          _UINT32_(0x2370)    /* (TRAM_RAM1244) TrustRAM Offset */
#define TRAM_RAM1245_REG_OFST          _UINT32_(0x2374)    /* (TRAM_RAM1245) TrustRAM Offset */
#define TRAM_RAM1246_REG_OFST          _UINT32_(0x2378)    /* (TRAM_RAM1246) TrustRAM Offset */
#define TRAM_RAM1247_REG_OFST          _UINT32_(0x237C)    /* (TRAM_RAM1247) TrustRAM Offset */
