Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/tram.h
#define TRAM_RAM1748_REG_OFST          _UINT32_(0x2B50)    /* (TRAM_RAM1748) TrustRAM Offset */
#define TRAM_RAM1749_REG_OFST          _UINT32_(0x2B54)    /* (TRAM_RAM1749) TrustRAM Offset */
#define TRAM_RAM1750_REG_OFST          _UINT32_(0x2B58)    /* (TRAM_RAM1750) TrustRAM Offset */
#define TRAM_RAM1751_REG_OFST          _UINT32_(0x2B5C)    /* (TRAM_RAM1751) TrustRAM Offset */
#define TRAM_RAM1752_REG_OFST          _UINT32_(0x2B60)    /* (TRAM_RAM1752) TrustRAM Offset */
#define TRAM_RAM1753_REG_OFST          _UINT32_(0x2B64)    /* (TRAM_RAM1753) TrustRAM Offset */
#define TRAM_RAM1754_REG_OFST          _UINT32_(0x2B68)    /* (TRAM_RAM1754) TrustRAM Offset */
#define TRAM_RAM1755_REG_OFST          _UINT32_(0x2B6C)    /* (TRAM_RAM1755) TrustRAM Offset */
#define TRAM_RAM1756_REG_OFST          _UINT32_(0x2B70)    /* (TRAM_RAM1756) TrustRAM Offset */
#define TRAM_RAM1757_REG_OFST          _UINT32_(0x2B74)    /* (TRAM_RAM1757) TrustRAM Offset */
#define TRAM_RAM1758_REG_OFST          _UINT32_(0x2B78)    /* (TRAM_RAM1758) TrustRAM Offset */
#define TRAM_RAM1759_REG_OFST          _UINT32_(0x2B7C)    /* (TRAM_RAM1759) TrustRAM Offset */
#define TRAM_RAM1760_REG_OFST          _UINT32_(0x2B80)    /* (TRAM_RAM1760) TrustRAM Offset */
#define TRAM_RAM1761_REG_OFST          _UINT32_(0x2B84)    /* (TRAM_RAM1761) TrustRAM Offset */
#define TRAM_RAM1762_REG_OFST          _UINT32_(0x2B88)    /* (TRAM_RAM1762) TrustRAM Offset */
#define TRAM_RAM1763_REG_OFST          _UINT32_(0x2B8C)    /* (TRAM_RAM1763) TrustRAM Offset */
#define TRAM_RAM1764_REG_OFST          _UINT32_(0x2B90)    /* (TRAM_RAM1764) TrustRAM Offset */
#define TRAM_RAM1765_REG_OFST          _UINT32_(0x2B94)    /* (TRAM_RAM1765) TrustRAM Offset */
#define TRAM_RAM1766_REG_OFST          _UINT32_(0x2B98)    /* (TRAM_RAM1766) TrustRAM Offset */
#define TRAM_RAM1767_REG_OFST          _UINT32_(0x2B9C)    /* (TRAM_RAM1767) TrustRAM Offset */
#define TRAM_RAM1768_REG_OFST          _UINT32_(0x2BA0)    /* (TRAM_RAM1768) TrustRAM Offset */
#define TRAM_RAM1769_REG_OFST          _UINT32_(0x2BA4)    /* (TRAM_RAM1769) TrustRAM Offset */
#define TRAM_RAM1770_REG_OFST          _UINT32_(0x2BA8)    /* (TRAM_RAM1770) TrustRAM Offset */
#define TRAM_RAM1771_REG_OFST          _UINT32_(0x2BAC)    /* (TRAM_RAM1771) TrustRAM Offset */
#define TRAM_RAM1772_REG_OFST          _UINT32_(0x2BB0)    /* (TRAM_RAM1772) TrustRAM Offset */
#define TRAM_RAM1773_REG_OFST          _UINT32_(0x2BB4)    /* (TRAM_RAM1773) TrustRAM Offset */
#define TRAM_RAM1774_REG_OFST          _UINT32_(0x2BB8)    /* (TRAM_RAM1774) TrustRAM Offset */
#define TRAM_RAM1775_REG_OFST          _UINT32_(0x2BBC)    /* (TRAM_RAM1775) TrustRAM Offset */
#define TRAM_RAM1776_REG_OFST          _UINT32_(0x2BC0)    /* (TRAM_RAM1776) TrustRAM Offset */
#define TRAM_RAM1777_REG_OFST          _UINT32_(0x2BC4)    /* (TRAM_RAM1777) TrustRAM Offset */
#define TRAM_RAM1778_REG_OFST          _UINT32_(0x2BC8)    /* (TRAM_RAM1778) TrustRAM Offset */
#define TRAM_RAM1779_REG_OFST          _UINT32_(0x2BCC)    /* (TRAM_RAM1779) TrustRAM Offset */
#define TRAM_RAM1780_REG_OFST          _UINT32_(0x2BD0)    /* (TRAM_RAM1780) TrustRAM Offset */
#define TRAM_RAM1781_REG_OFST          _UINT32_(0x2BD4)    /* (TRAM_RAM1781) TrustRAM Offset */
#define TRAM_RAM1782_REG_OFST          _UINT32_(0x2BD8)    /* (TRAM_RAM1782) TrustRAM Offset */
#define TRAM_RAM1783_REG_OFST          _UINT32_(0x2BDC)    /* (TRAM_RAM1783) TrustRAM Offset */
#define TRAM_RAM1784_REG_OFST          _UINT32_(0x2BE0)    /* (TRAM_RAM1784) TrustRAM Offset */
#define TRAM_RAM1785_REG_OFST          _UINT32_(0x2BE4)    /* (TRAM_RAM1785) TrustRAM Offset */
#define TRAM_RAM1786_REG_OFST          _UINT32_(0x2BE8)    /* (TRAM_RAM1786) TrustRAM Offset */
#define TRAM_RAM1787_REG_OFST          _UINT32_(0x2BEC)    /* (TRAM_RAM1787) TrustRAM Offset */
#define TRAM_RAM1788_REG_OFST          _UINT32_(0x2BF0)    /* (TRAM_RAM1788) TrustRAM Offset */
#define TRAM_RAM1789_REG_OFST          _UINT32_(0x2BF4)    /* (TRAM_RAM1789) TrustRAM Offset */
#define TRAM_RAM1790_REG_OFST          _UINT32_(0x2BF8)    /* (TRAM_RAM1790) TrustRAM Offset */
#define TRAM_RAM1791_REG_OFST          _UINT32_(0x2BFC)    /* (TRAM_RAM1791) TrustRAM Offset */
#define TRAM_RAM1792_REG_OFST          _UINT32_(0x2C00)    /* (TRAM_RAM1792) TrustRAM Offset */
#define TRAM_RAM1793_REG_OFST          _UINT32_(0x2C04)    /* (TRAM_RAM1793) TrustRAM Offset */
#define TRAM_RAM1794_REG_OFST          _UINT32_(0x2C08)    /* (TRAM_RAM1794) TrustRAM Offset */
#define TRAM_RAM1795_REG_OFST          _UINT32_(0x2C0C)    /* (TRAM_RAM1795) TrustRAM Offset */
#define TRAM_RAM1796_REG_OFST          _UINT32_(0x2C10)    /* (TRAM_RAM1796) TrustRAM Offset */
#define TRAM_RAM1797_REG_OFST          _UINT32_(0x2C14)    /* (TRAM_RAM1797) TrustRAM Offset */
#define TRAM_RAM1798_REG_OFST          _UINT32_(0x2C18)    /* (TRAM_RAM1798) TrustRAM Offset */
#define TRAM_RAM1799_REG_OFST          _UINT32_(0x2C1C)    /* (TRAM_RAM1799) TrustRAM Offset */
#define TRAM_RAM1800_REG_OFST          _UINT32_(0x2C20)    /* (TRAM_RAM1800) TrustRAM Offset */
#define TRAM_RAM1801_REG_OFST          _UINT32_(0x2C24)    /* (TRAM_RAM1801) TrustRAM Offset */
#define TRAM_RAM1802_REG_OFST          _UINT32_(0x2C28)    /* (TRAM_RAM1802) TrustRAM Offset */
#define TRAM_RAM1803_REG_OFST          _UINT32_(0x2C2C)    /* (TRAM_RAM1803) TrustRAM Offset */
#define TRAM_RAM1804_REG_OFST          _UINT32_(0x2C30)    /* (TRAM_RAM1804) TrustRAM Offset */
#define TRAM_RAM1805_REG_OFST          _UINT32_(0x2C34)    /* (TRAM_RAM1805) TrustRAM Offset */
#define TRAM_RAM1806_REG_OFST          _UINT32_(0x2C38)    /* (TRAM_RAM1806) TrustRAM Offset */
#define TRAM_RAM1807_REG_OFST          _UINT32_(0x2C3C)    /* (TRAM_RAM1807) TrustRAM Offset */
#define TRAM_RAM1808_REG_OFST          _UINT32_(0x2C40)    /* (TRAM_RAM1808) TrustRAM Offset */
#define TRAM_RAM1809_REG_OFST          _UINT32_(0x2C44)    /* (TRAM_RAM1809) TrustRAM Offset */
#define TRAM_RAM1810_REG_OFST          _UINT32_(0x2C48)    /* (TRAM_RAM1810) TrustRAM Offset */
#define TRAM_RAM1811_REG_OFST          _UINT32_(0x2C4C)    /* (TRAM_RAM1811) TrustRAM Offset */
#define TRAM_RAM1812_REG_OFST          _UINT32_(0x2C50)    /* (TRAM_RAM1812) TrustRAM Offset */
#define TRAM_RAM1813_REG_OFST          _UINT32_(0x2C54)    /* (TRAM_RAM1813) TrustRAM Offset */
#define TRAM_RAM1814_REG_OFST          _UINT32_(0x2C58)    /* (TRAM_RAM1814) TrustRAM Offset */
#define TRAM_RAM1815_REG_OFST          _UINT32_(0x2C5C)    /* (TRAM_RAM1815) TrustRAM Offset */
#define TRAM_RAM1816_REG_OFST          _UINT32_(0x2C60)    /* (TRAM_RAM1816) TrustRAM Offset */
#define TRAM_RAM1817_REG_OFST          _UINT32_(0x2C64)    /* (TRAM_RAM1817) TrustRAM Offset */
#define TRAM_RAM1818_REG_OFST          _UINT32_(0x2C68)    /* (TRAM_RAM1818) TrustRAM Offset */
#define TRAM_RAM1819_REG_OFST          _UINT32_(0x2C6C)    /* (TRAM_RAM1819) TrustRAM Offset */
#define TRAM_RAM1820_REG_OFST          _UINT32_(0x2C70)    /* (TRAM_RAM1820) TrustRAM Offset */
#define TRAM_RAM1821_REG_OFST          _UINT32_(0x2C74)    /* (TRAM_RAM1821) TrustRAM Offset */
#define TRAM_RAM1822_REG_OFST          _UINT32_(0x2C78)    /* (TRAM_RAM1822) TrustRAM Offset */
#define TRAM_RAM1823_REG_OFST          _UINT32_(0x2C7C)    /* (TRAM_RAM1823) TrustRAM Offset */
#define TRAM_RAM1824_REG_OFST          _UINT32_(0x2C80)    /* (TRAM_RAM1824) TrustRAM Offset */
#define TRAM_RAM1825_REG_OFST          _UINT32_(0x2C84)    /* (TRAM_RAM1825) TrustRAM Offset */
#define TRAM_RAM1826_REG_OFST          _UINT32_(0x2C88)    /* (TRAM_RAM1826) TrustRAM Offset */
#define TRAM_RAM1827_REG_OFST          _UINT32_(0x2C8C)    /* (TRAM_RAM1827) TrustRAM Offset */
#define TRAM_RAM1828_REG_OFST          _UINT32_(0x2C90)    /* (TRAM_RAM1828) TrustRAM Offset */
#define TRAM_RAM1829_REG_OFST          _UINT32_(0x2C94)    /* (TRAM_RAM1829) TrustRAM Offset */
#define TRAM_RAM1830_REG_OFST          _UINT32_(0x2C98)    /* (TRAM_RAM1830) TrustRAM Offset */
#define TRAM_RAM1831_REG_OFST          _UINT32_(0x2C9C)    /* (TRAM_RAM1831) TrustRAM Offset */
#define TRAM_RAM1832_REG_OFST          _UINT32_(0x2CA0)    /* (TRAM_RAM1832) TrustRAM Offset */
#define TRAM_RAM1833_REG_OFST          _UINT32_(0x2CA4)    /* (TRAM_RAM1833) TrustRAM Offset */
#define TRAM_RAM1834_REG_OFST          _UINT32_(0x2CA8)    /* (TRAM_RAM1834) TrustRAM Offset */
#define TRAM_RAM1835_REG_OFST          _UINT32_(0x2CAC)    /* (TRAM_RAM1835) TrustRAM Offset */
#define TRAM_RAM1836_REG_OFST          _UINT32_(0x2CB0)    /* (TRAM_RAM1836) TrustRAM Offset */
#define TRAM_RAM1837_REG_OFST          _UINT32_(0x2CB4)    /* (TRAM_RAM1837) TrustRAM Offset */
#define TRAM_RAM1838_REG_OFST          _UINT32_(0x2CB8)    /* (TRAM_RAM1838) TrustRAM Offset */
#define TRAM_RAM1839_REG_OFST          _UINT32_(0x2CBC)    /* (TRAM_RAM1839) TrustRAM Offset */
#define TRAM_RAM1840_REG_OFST          _UINT32_(0x2CC0)    /* (TRAM_RAM1840) TrustRAM Offset */
#define TRAM_RAM1841_REG_OFST          _UINT32_(0x2CC4)    /* (TRAM_RAM1841) TrustRAM Offset */
#define TRAM_RAM1842_REG_OFST          _UINT32_(0x2CC8)    /* (TRAM_RAM1842) TrustRAM Offset */
#define TRAM_RAM1843_REG_OFST          _UINT32_(0x2CCC)    /* (TRAM_RAM1843) TrustRAM Offset */
#define TRAM_RAM1844_REG_OFST          _UINT32_(0x2CD0)    /* (TRAM_RAM1844) TrustRAM Offset */
#define TRAM_RAM1845_REG_OFST          _UINT32_(0x2CD4)    /* (TRAM_RAM1845) TrustRAM Offset */
#define TRAM_RAM1846_REG_OFST          _UINT32_(0x2CD8)    /* (TRAM_RAM1846) TrustRAM Offset */
#define TRAM_RAM1847_REG_OFST          _UINT32_(0x2CDC)    /* (TRAM_RAM1847) TrustRAM Offset */
#define TRAM_RAM1848_REG_OFST          _UINT32_(0x2CE0)    /* (TRAM_RAM1848) TrustRAM Offset */
#define TRAM_RAM1849_REG_OFST          _UINT32_(0x2CE4)    /* (TRAM_RAM1849) TrustRAM Offset */
#define TRAM_RAM1850_REG_OFST          _UINT32_(0x2CE8)    /* (TRAM_RAM1850) TrustRAM Offset */
#define TRAM_RAM1851_REG_OFST          _UINT32_(0x2CEC)    /* (TRAM_RAM1851) TrustRAM Offset */
#define TRAM_RAM1852_REG_OFST          _UINT32_(0x2CF0)    /* (TRAM_RAM1852) TrustRAM Offset */
#define TRAM_RAM1853_REG_OFST          _UINT32_(0x2CF4)    /* (TRAM_RAM1853) TrustRAM Offset */
#define TRAM_RAM1854_REG_OFST          _UINT32_(0x2CF8)    /* (TRAM_RAM1854) TrustRAM Offset */
#define TRAM_RAM1855_REG_OFST          _UINT32_(0x2CFC)    /* (TRAM_RAM1855) TrustRAM Offset */
#define TRAM_RAM1856_REG_OFST          _UINT32_(0x2D00)    /* (TRAM_RAM1856) TrustRAM Offset */
#define TRAM_RAM1857_REG_OFST          _UINT32_(0x2D04)    /* (TRAM_RAM1857) TrustRAM Offset */
#define TRAM_RAM1858_REG_OFST          _UINT32_(0x2D08)    /* (TRAM_RAM1858) TrustRAM Offset */
#define TRAM_RAM1859_REG_OFST          _UINT32_(0x2D0C)    /* (TRAM_RAM1859) TrustRAM Offset */
#define TRAM_RAM1860_REG_OFST          _UINT32_(0x2D10)    /* (TRAM_RAM1860) TrustRAM Offset */
#define TRAM_RAM1861_REG_OFST          _UINT32_(0x2D14)    /* (TRAM_RAM1861) TrustRAM Offset */
#define TRAM_RAM1862_REG_OFST          _UINT32_(0x2D18)    /* (TRAM_RAM1862) TrustRAM Offset */
#define TRAM_RAM1863_REG_OFST          _UINT32_(0x2D1C)    /* (TRAM_RAM1863) TrustRAM Offset */
#define TRAM_RAM1864_REG_OFST          _UINT32_(0x2D20)    /* (TRAM_RAM1864) TrustRAM Offset */
#define TRAM_RAM1865_REG_OFST          _UINT32_(0x2D24)    /* (TRAM_RAM1865) TrustRAM Offset */
#define TRAM_RAM1866_REG_OFST          _UINT32_(0x2D28)    /* (TRAM_RAM1866) TrustRAM Offset */
#define TRAM_RAM1867_REG_OFST          _UINT32_(0x2D2C)    /* (TRAM_RAM1867) TrustRAM Offset */
#define TRAM_RAM1868_REG_OFST          _UINT32_(0x2D30)    /* (TRAM_RAM1868) TrustRAM Offset */
#define TRAM_RAM1869_REG_OFST          _UINT32_(0x2D34)    /* (TRAM_RAM1869) TrustRAM Offset */
#define TRAM_RAM1870_REG_OFST          _UINT32_(0x2D38)    /* (TRAM_RAM1870) TrustRAM Offset */
#define TRAM_RAM1871_REG_OFST          _UINT32_(0x2D3C)    /* (TRAM_RAM1871) TrustRAM Offset */
#define TRAM_RAM1872_REG_OFST          _UINT32_(0x2D40)    /* (TRAM_RAM1872) TrustRAM Offset */
#define TRAM_RAM1873_REG_OFST          _UINT32_(0x2D44)    /* (TRAM_RAM1873) TrustRAM Offset */
#define TRAM_RAM1874_REG_OFST          _UINT32_(0x2D48)    /* (TRAM_RAM1874) TrustRAM Offset */
#define TRAM_RAM1875_REG_OFST          _UINT32_(0x2D4C)    /* (TRAM_RAM1875) TrustRAM Offset */
#define TRAM_RAM1876_REG_OFST          _UINT32_(0x2D50)    /* (TRAM_RAM1876) TrustRAM Offset */
#define TRAM_RAM1877_REG_OFST          _UINT32_(0x2D54)    /* (TRAM_RAM1877) TrustRAM Offset */
#define TRAM_RAM1878_REG_OFST          _UINT32_(0x2D58)    /* (TRAM_RAM1878) TrustRAM Offset */
#define TRAM_RAM1879_REG_OFST          _UINT32_(0x2D5C)    /* (TRAM_RAM1879) TrustRAM Offset */
#define TRAM_RAM1880_REG_OFST          _UINT32_(0x2D60)    /* (TRAM_RAM1880) TrustRAM Offset */
#define TRAM_RAM1881_REG_OFST          _UINT32_(0x2D64)    /* (TRAM_RAM1881) TrustRAM Offset */
#define TRAM_RAM1882_REG_OFST          _UINT32_(0x2D68)    /* (TRAM_RAM1882) TrustRAM Offset */
#define TRAM_RAM1883_REG_OFST          _UINT32_(0x2D6C)    /* (TRAM_RAM1883) TrustRAM Offset */
#define TRAM_RAM1884_REG_OFST          _UINT32_(0x2D70)    /* (TRAM_RAM1884) TrustRAM Offset */
#define TRAM_RAM1885_REG_OFST          _UINT32_(0x2D74)    /* (TRAM_RAM1885) TrustRAM Offset */
#define TRAM_RAM1886_REG_OFST          _UINT32_(0x2D78)    /* (TRAM_RAM1886) TrustRAM Offset */
#define TRAM_RAM1887_REG_OFST          _UINT32_(0x2D7C)    /* (TRAM_RAM1887) TrustRAM Offset */
#define TRAM_RAM1888_REG_OFST          _UINT32_(0x2D80)    /* (TRAM_RAM1888) TrustRAM Offset */
#define TRAM_RAM1889_REG_OFST          _UINT32_(0x2D84)    /* (TRAM_RAM1889) TrustRAM Offset */
#define TRAM_RAM1890_REG_OFST          _UINT32_(0x2D88)    /* (TRAM_RAM1890) TrustRAM Offset */
#define TRAM_RAM1891_REG_OFST          _UINT32_(0x2D8C)    /* (TRAM_RAM1891) TrustRAM Offset */
#define TRAM_RAM1892_REG_OFST          _UINT32_(0x2D90)    /* (TRAM_RAM1892) TrustRAM Offset */
#define TRAM_RAM1893_REG_OFST          _UINT32_(0x2D94)    /* (TRAM_RAM1893) TrustRAM Offset */
#define TRAM_RAM1894_REG_OFST          _UINT32_(0x2D98)    /* (TRAM_RAM1894) TrustRAM Offset */
#define TRAM_RAM1895_REG_OFST          _UINT32_(0x2D9C)    /* (TRAM_RAM1895) TrustRAM Offset */
#define TRAM_RAM1896_REG_OFST          _UINT32_(0x2DA0)    /* (TRAM_RAM1896) TrustRAM Offset */
#define TRAM_RAM1897_REG_OFST          _UINT32_(0x2DA4)    /* (TRAM_RAM1897) TrustRAM Offset */
#define TRAM_RAM1898_REG_OFST          _UINT32_(0x2DA8)    /* (TRAM_RAM1898) TrustRAM Offset */
#define TRAM_RAM1899_REG_OFST          _UINT32_(0x2DAC)    /* (TRAM_RAM1899) TrustRAM Offset */
#define TRAM_RAM1900_REG_OFST          _UINT32_(0x2DB0)    /* (TRAM_RAM1900) TrustRAM Offset */
#define TRAM_RAM1901_REG_OFST          _UINT32_(0x2DB4)    /* (TRAM_RAM1901) TrustRAM Offset */
#define TRAM_RAM1902_REG_OFST          _UINT32_(0x2DB8)    /* (TRAM_RAM1902) TrustRAM Offset */
#define TRAM_RAM1903_REG_OFST          _UINT32_(0x2DBC)    /* (TRAM_RAM1903) TrustRAM Offset */
#define TRAM_RAM1904_REG_OFST          _UINT32_(0x2DC0)    /* (TRAM_RAM1904) TrustRAM Offset */
#define TRAM_RAM1905_REG_OFST          _UINT32_(0x2DC4)    /* (TRAM_RAM1905) TrustRAM Offset */
#define TRAM_RAM1906_REG_OFST          _UINT32_(0x2DC8)    /* (TRAM_RAM1906) TrustRAM Offset */
#define TRAM_RAM1907_REG_OFST          _UINT32_(0x2DCC)    /* (TRAM_RAM1907) TrustRAM Offset */
#define TRAM_RAM1908_REG_OFST          _UINT32_(0x2DD0)    /* (TRAM_RAM1908) TrustRAM Offset */
#define TRAM_RAM1909_REG_OFST          _UINT32_(0x2DD4)    /* (TRAM_RAM1909) TrustRAM Offset */
#define TRAM_RAM1910_REG_OFST          _UINT32_(0x2DD8)    /* (TRAM_RAM1910) TrustRAM Offset */
#define TRAM_RAM1911_REG_OFST          _UINT32_(0x2DDC)    /* (TRAM_RAM1911) TrustRAM Offset */
#define TRAM_RAM1912_REG_OFST          _UINT32_(0x2DE0)    /* (TRAM_RAM1912) TrustRAM Offset */
#define TRAM_RAM1913_REG_OFST          _UINT32_(0x2DE4)    /* (TRAM_RAM1913) TrustRAM Offset */
#define TRAM_RAM1914_REG_OFST          _UINT32_(0x2DE8)    /* (TRAM_RAM1914) TrustRAM Offset */
#define TRAM_RAM1915_REG_OFST          _UINT32_(0x2DEC)    /* (TRAM_RAM1915) TrustRAM Offset */
#define TRAM_RAM1916_REG_OFST          _UINT32_(0x2DF0)    /* (TRAM_RAM1916) TrustRAM Offset */
#define TRAM_RAM1917_REG_OFST          _UINT32_(0x2DF4)    /* (TRAM_RAM1917) TrustRAM Offset */
#define TRAM_RAM1918_REG_OFST          _UINT32_(0x2DF8)    /* (TRAM_RAM1918) TrustRAM Offset */
#define TRAM_RAM1919_REG_OFST          _UINT32_(0x2DFC)    /* (TRAM_RAM1919) TrustRAM Offset */
#define TRAM_RAM1920_REG_OFST          _UINT32_(0x2E00)    /* (TRAM_RAM1920) TrustRAM Offset */
#define TRAM_RAM1921_REG_OFST          _UINT32_(0x2E04)    /* (TRAM_RAM1921) TrustRAM Offset */
#define TRAM_RAM1922_REG_OFST          _UINT32_(0x2E08)    /* (TRAM_RAM1922) TrustRAM Offset */
#define TRAM_RAM1923_REG_OFST          _UINT32_(0x2E0C)    /* (TRAM_RAM1923) TrustRAM Offset */
#define TRAM_RAM1924_REG_OFST          _UINT32_(0x2E10)    /* (TRAM_RAM1924) TrustRAM Offset */
#define TRAM_RAM1925_REG_OFST          _UINT32_(0x2E14)    /* (TRAM_RAM1925) TrustRAM Offset */
#define TRAM_RAM1926_REG_OFST          _UINT32_(0x2E18)    /* (TRAM_RAM1926) TrustRAM Offset */
#define TRAM_RAM1927_REG_OFST          _UINT32_(0x2E1C)    /* (TRAM_RAM1927) TrustRAM Offset */
#define TRAM_RAM1928_REG_OFST          _UINT32_(0x2E20)    /* (TRAM_RAM1928) TrustRAM Offset */
#define TRAM_RAM1929_REG_OFST          _UINT32_(0x2E24)    /* (TRAM_RAM1929) TrustRAM Offset */
#define TRAM_RAM1930_REG_OFST          _UINT32_(0x2E28)    /* (TRAM_RAM1930) TrustRAM Offset */
#define TRAM_RAM1931_REG_OFST          _UINT32_(0x2E2C)    /* (TRAM_RAM1931) TrustRAM Offset */
#define TRAM_RAM1932_REG_OFST          _UINT32_(0x2E30)    /* (TRAM_RAM1932) TrustRAM Offset */
#define TRAM_RAM1933_REG_OFST          _UINT32_(0x2E34)    /* (TRAM_RAM1933) TrustRAM Offset */
#define TRAM_RAM1934_REG_OFST          _UINT32_(0x2E38)    /* (TRAM_RAM1934) TrustRAM Offset */
#define TRAM_RAM1935_REG_OFST          _UINT32_(0x2E3C)    /* (TRAM_RAM1935) TrustRAM Offset */
#define TRAM_RAM1936_REG_OFST          _UINT32_(0x2E40)    /* (TRAM_RAM1936) TrustRAM Offset */
#define TRAM_RAM1937_REG_OFST          _UINT32_(0x2E44)    /* (TRAM_RAM1937) TrustRAM Offset */
#define TRAM_RAM1938_REG_OFST          _UINT32_(0x2E48)    /* (TRAM_RAM1938) TrustRAM Offset */
#define TRAM_RAM1939_REG_OFST          _UINT32_(0x2E4C)    /* (TRAM_RAM1939) TrustRAM Offset */
#define TRAM_RAM1940_REG_OFST          _UINT32_(0x2E50)    /* (TRAM_RAM1940) TrustRAM Offset */
#define TRAM_RAM1941_REG_OFST          _UINT32_(0x2E54)    /* (TRAM_RAM1941) TrustRAM Offset */
#define TRAM_RAM1942_REG_OFST          _UINT32_(0x2E58)    /* (TRAM_RAM1942) TrustRAM Offset */
#define TRAM_RAM1943_REG_OFST          _UINT32_(0x2E5C)    /* (TRAM_RAM1943) TrustRAM Offset */
#define TRAM_RAM1944_REG_OFST          _UINT32_(0x2E60)    /* (TRAM_RAM1944) TrustRAM Offset */
#define TRAM_RAM1945_REG_OFST          _UINT32_(0x2E64)    /* (TRAM_RAM1945) TrustRAM Offset */
#define TRAM_RAM1946_REG_OFST          _UINT32_(0x2E68)    /* (TRAM_RAM1946) TrustRAM Offset */
#define TRAM_RAM1947_REG_OFST          _UINT32_(0x2E6C)    /* (TRAM_RAM1947) TrustRAM Offset */
#define TRAM_RAM1948_REG_OFST          _UINT32_(0x2E70)    /* (TRAM_RAM1948) TrustRAM Offset */
#define TRAM_RAM1949_REG_OFST          _UINT32_(0x2E74)    /* (TRAM_RAM1949) TrustRAM Offset */
#define TRAM_RAM1950_REG_OFST          _UINT32_(0x2E78)    /* (TRAM_RAM1950) TrustRAM Offset */
#define TRAM_RAM1951_REG_OFST          _UINT32_(0x2E7C)    /* (TRAM_RAM1951) TrustRAM Offset */
#define TRAM_RAM1952_REG_OFST          _UINT32_(0x2E80)    /* (TRAM_RAM1952) TrustRAM Offset */
#define TRAM_RAM1953_REG_OFST          _UINT32_(0x2E84)    /* (TRAM_RAM1953) TrustRAM Offset */
#define TRAM_RAM1954_REG_OFST          _UINT32_(0x2E88)    /* (TRAM_RAM1954) TrustRAM Offset */
#define TRAM_RAM1955_REG_OFST          _UINT32_(0x2E8C)    /* (TRAM_RAM1955) TrustRAM Offset */
#define TRAM_RAM1956_REG_OFST          _UINT32_(0x2E90)    /* (TRAM_RAM1956) TrustRAM Offset */
#define TRAM_RAM1957_REG_OFST          _UINT32_(0x2E94)    /* (TRAM_RAM1957) TrustRAM Offset */
#define TRAM_RAM1958_REG_OFST          _UINT32_(0x2E98)    /* (TRAM_RAM1958) TrustRAM Offset */
#define TRAM_RAM1959_REG_OFST          _UINT32_(0x2E9C)    /* (TRAM_RAM1959) TrustRAM Offset */
#define TRAM_RAM1960_REG_OFST          _UINT32_(0x2EA0)    /* (TRAM_RAM1960) TrustRAM Offset */
#define TRAM_RAM1961_REG_OFST          _UINT32_(0x2EA4)    /* (TRAM_RAM1961) TrustRAM Offset */
#define TRAM_RAM1962_REG_OFST          _UINT32_(0x2EA8)    /* (TRAM_RAM1962) TrustRAM Offset */
#define TRAM_RAM1963_REG_OFST          _UINT32_(0x2EAC)    /* (TRAM_RAM1963) TrustRAM Offset */
#define TRAM_RAM1964_REG_OFST          _UINT32_(0x2EB0)    /* (TRAM_RAM1964) TrustRAM Offset */
#define TRAM_RAM1965_REG_OFST          _UINT32_(0x2EB4)    /* (TRAM_RAM1965) TrustRAM Offset */
#define TRAM_RAM1966_REG_OFST          _UINT32_(0x2EB8)    /* (TRAM_RAM1966) TrustRAM Offset */
#define TRAM_RAM1967_REG_OFST          _UINT32_(0x2EBC)    /* (TRAM_RAM1967) TrustRAM Offset */
#define TRAM_RAM1968_REG_OFST          _UINT32_(0x2EC0)    /* (TRAM_RAM1968) TrustRAM Offset */
#define TRAM_RAM1969_REG_OFST          _UINT32_(0x2EC4)    /* (TRAM_RAM1969) TrustRAM Offset */
#define TRAM_RAM1970_REG_OFST          _UINT32_(0x2EC8)    /* (TRAM_RAM1970) TrustRAM Offset */
#define TRAM_RAM1971_REG_OFST          _UINT32_(0x2ECC)    /* (TRAM_RAM1971) TrustRAM Offset */
#define TRAM_RAM1972_REG_OFST          _UINT32_(0x2ED0)    /* (TRAM_RAM1972) TrustRAM Offset */
#define TRAM_RAM1973_REG_OFST          _UINT32_(0x2ED4)    /* (TRAM_RAM1973) TrustRAM Offset */
#define TRAM_RAM1974_REG_OFST          _UINT32_(0x2ED8)    /* (TRAM_RAM1974) TrustRAM Offset */
#define TRAM_RAM1975_REG_OFST          _UINT32_(0x2EDC)    /* (TRAM_RAM1975) TrustRAM Offset */
#define TRAM_RAM1976_REG_OFST          _UINT32_(0x2EE0)    /* (TRAM_RAM1976) TrustRAM Offset */
#define TRAM_RAM1977_REG_OFST          _UINT32_(0x2EE4)    /* (TRAM_RAM1977) TrustRAM Offset */
#define TRAM_RAM1978_REG_OFST          _UINT32_(0x2EE8)    /* (TRAM_RAM1978) TrustRAM Offset */
#define TRAM_RAM1979_REG_OFST          _UINT32_(0x2EEC)    /* (TRAM_RAM1979) TrustRAM Offset */
#define TRAM_RAM1980_REG_OFST          _UINT32_(0x2EF0)    /* (TRAM_RAM1980) TrustRAM Offset */
#define TRAM_RAM1981_REG_OFST          _UINT32_(0x2EF4)    /* (TRAM_RAM1981) TrustRAM Offset */
#define TRAM_RAM1982_REG_OFST          _UINT32_(0x2EF8)    /* (TRAM_RAM1982) TrustRAM Offset */
#define TRAM_RAM1983_REG_OFST          _UINT32_(0x2EFC)    /* (TRAM_RAM1983) TrustRAM Offset */
#define TRAM_RAM1984_REG_OFST          _UINT32_(0x2F00)    /* (TRAM_RAM1984) TrustRAM Offset */
#define TRAM_RAM1985_REG_OFST          _UINT32_(0x2F04)    /* (TRAM_RAM1985) TrustRAM Offset */
#define TRAM_RAM1986_REG_OFST          _UINT32_(0x2F08)    /* (TRAM_RAM1986) TrustRAM Offset */
#define TRAM_RAM1987_REG_OFST          _UINT32_(0x2F0C)    /* (TRAM_RAM1987) TrustRAM Offset */
#define TRAM_RAM1988_REG_OFST          _UINT32_(0x2F10)    /* (TRAM_RAM1988) TrustRAM Offset */
#define TRAM_RAM1989_REG_OFST          _UINT32_(0x2F14)    /* (TRAM_RAM1989) TrustRAM Offset */
#define TRAM_RAM1990_REG_OFST          _UINT32_(0x2F18)    /* (TRAM_RAM1990) TrustRAM Offset */
#define TRAM_RAM1991_REG_OFST          _UINT32_(0x2F1C)    /* (TRAM_RAM1991) TrustRAM Offset */
#define TRAM_RAM1992_REG_OFST          _UINT32_(0x2F20)    /* (TRAM_RAM1992) TrustRAM Offset */
#define TRAM_RAM1993_REG_OFST          _UINT32_(0x2F24)    /* (TRAM_RAM1993) TrustRAM Offset */
#define TRAM_RAM1994_REG_OFST          _UINT32_(0x2F28)    /* (TRAM_RAM1994) TrustRAM Offset */
#define TRAM_RAM1995_REG_OFST          _UINT32_(0x2F2C)    /* (TRAM_RAM1995) TrustRAM Offset */
#define TRAM_RAM1996_REG_OFST          _UINT32_(0x2F30)    /* (TRAM_RAM1996) TrustRAM Offset */
#define TRAM_RAM1997_REG_OFST          _UINT32_(0x2F34)    /* (TRAM_RAM1997) TrustRAM Offset */
